const quizData = {
  "middle-info": {
    "goal": [
      {
        "area": "",
        "question": "'정보(Informatics)'과는 인공지능으로 정의되는 사회에서 데이터와 정보로 인한 디지털 세상의 변화를 인식하고, 정보의 사회적 가치를 탐구하며, 정보를 처리하는 다양한 원리와 기술에 기반한 ＿＿＿＿을 바탕으로 실생활 및 다양한 학문 분야의 문제를 해결하는 능력과 태도를 기르는 교과이다.",
        "answer": "컴퓨팅 사고력"
      },
      {
        "area": "",
        "question": "'정보'는 디지털 대전환 시대의 국가·사회적 요구에 부응하여, ＿＿＿＿을 활용한 문제 해결을 위해 사회 구성원이 갖추어야 할 필수 역량을 제공한다.",
        "answer": "컴퓨팅"
      },
      {
        "area": "",
        "question": "'정보'의 학문적 기저는 컴퓨터에서 처리되는 데이터와 정보의 원리, ＿＿＿＿을 설계하고 구현하는 기술과 방법, 정보를 다루는 인간 사회에 대한 이해 등을 포괄하고 있다.",
        "answer": "컴퓨팅 시스템"
      },
      {
        "area": "",
        "question": "'정보'는 컴퓨터 과학뿐 아니라 데이터 과학, 인공지능, 정보기술, 정보시스템, ＿＿＿＿ 등의 분야를 포괄하는 정보학에 대한 기본 개념과 원리를 기반으로 다양한 학문 분야와 미래 사회의 문제를 해결하는 데 도움이 되는 지식과 기술을 함양한다.",
        "answer": "소프트웨어 공학"
      },
      {
        "area": "",
        "question": "교과의 이러한 특성은 사회 각 분야에서 요구되는 소프트웨어와 인공지능에 대한 기본 소양을 갖추고, 공학뿐만 아니라 자연과학, 인문·사회과학, 예술과 체육 등 다양한 학문 분야에서 문제를 창의적으로 해결하는 ＿＿＿＿ 양성에 도움을 준다.",
        "answer": "인재"
      },
      {
        "area": "",
        "question": "모든 학생이 기초적으로 갖추어야 할 ＿＿＿＿의 근본이 되는 '정보'는 학생들이 미래 사회가 요구하는 컴퓨팅, 디지털에 대한 역량과 자기주도성을 갖춘 인간으로 성장하게 한다.",
        "answer": "디지털 소양"
      },
      {
        "area": "",
        "question": "'정보'는 컴퓨팅 사고력에 기반한 지식정보처리, 창의적 사고, 타인과 협업하고 공유하는 협력적 소통 역량과 공동체 역량 등을 갖춘 ＿＿＿＿으로 성장하게 한다.",
        "answer": "디지털 민주시민"
      },
      {
        "area": "",
        "question": "중학교 '정보'는 컴퓨팅과 인공지능 기술 및 ＿＿＿＿에 대한 이해를 기반으로 미래 사회의 문제를 해결하는 데 필요한 기초적인 능력과 태도를 함양하도록 한다.",
        "answer": "디지털 문화"
      },
      {
        "area": "",
        "question": "중학교 '정보'는 초등학교 실과 내의 디지털 사회와 인공지능 영역 및 ＿＿＿＿ 교과의 모든 과목과 연계성을 갖는다.",
        "answer": "고등학교 정보"
      },
      {
        "area": "",
        "question": "중학교 '정보'는 다른 교과와의 융합을 통해 해당 분야의 문제를 새롭게 인식하게 하는 ＿＿＿＿를 제공한다.",
        "answer": "토대"
      },
      {
        "area": "",
        "question": "중학교 '정보'는 컴퓨팅 사고력을 기반으로 인공지능을 포함하는 컴퓨팅 기술을 활용하여 미래 사회에서 다양한 분야의 문제를 발견하고 해결할 수 있는 ＿＿＿＿을 함양하도록 하는 데 중점을 둔다.",
        "answer": "기초적인 능력"
      },
      {
        "area": "",
        "question": "디지털 세상의 데이터와 정보를 다루는 ＿＿＿＿를 이해하고, 실생활에서 정보를 다루는 시스템에 의해 처리된 결과의 영향력을 판단하는 능력을 기른다.",
        "answer": "컴퓨팅 장치"
      },
      {
        "area": "",
        "question": "컴퓨터로 처리되는 정보의 원리를 이해하고, 다양한 현상의 의미를 해석하는 데 도움이 되는 ＿＿＿＿의 중요성을 고려하여 데이터의 수집 및 분석, 처리를 위한 능력을 기른다.",
        "answer": "데이터"
      },
      {
        "area": "",
        "question": "컴퓨팅을 활용한 실생활의 문제 해결을 위해 문제를 발견, 분석, 추상화하여 해결책을 구상하고, 프로그램을 설계·구현하는 과정에서 ＿＿＿＿의 필요성과 중요성을 이해하고 실천하는 태도를 기른다.",
        "answer": "자동화"
      },
      {
        "area": "",
        "question": "인공지능으로 인한 세상의 변화를 이해하고, 기초 지식을 기반으로 인공지능을 활용한 문제 해결의 ＿＿＿＿을 탐색하는 태도와 능력을 기른다.",
        "answer": "가능성"
      },
      {
        "area": "",
        "question": "정보를 다루는 디지털 사회에 대한 특성을 이해하고, 미래 사회에서 디지털 기술의 영향력을 탐색하며, 디지털 사회를 살아가는데 필요한 ＿＿＿＿를 실천할 수 있는 태도를 기른다.",
        "answer": "디지털 윤리"
      }
    ],
    "content": [
      {
        "area": "컴퓨팅 시스템",
        "question": "하드웨어와 소프트웨어의 유기적 연결을 통해 동작하는 ＿＿＿＿은 사회적, 기술적 가치를 높이는 데 활용된다.",
        "answer": "컴퓨팅 시스템"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "컴퓨팅 시스템을 설계하는 것은 시스템에 대한 전체 흐름과 ＿＿＿＿의 가치를 이해하는 데 도움을 준다.",
        "answer": "자원 할당"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "컴퓨팅 시스템 영역의 지식·이해 내용에는 컴퓨팅 시스템의 동작 원리, ＿＿＿＿의 기능, 피지컬 컴퓨팅의 개념이 포함된다.",
        "answer": "운영 체제"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "컴퓨팅 시스템 영역의 지식·이해 내용에는 컴퓨팅 시스템의 동작 원리, 운영 체제의 기능, ＿＿＿＿의 개념이 포함된다.",
        "answer": "피지컬 컴퓨팅"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "컴퓨팅 시스템의 구성요소를 파악하고, 동작 원리를 ＿＿＿＿와 관계짓기는 컴퓨팅 시스템 영역의 과정·기능이다.",
        "answer": "운영 체제"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "생활 속에서 ＿＿＿＿이 적용된 사례 조사하기는 컴퓨팅 시스템 영역의 과정·기능이다.",
        "answer": "피지컬 컴퓨팅"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "＿＿＿＿ 구성하기는 컴퓨팅 시스템 영역의 과정·기능에 포함된다.",
        "answer": "피지컬 컴퓨팅 시스템"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "컴퓨팅 시스템의 필요성과 가치를 판단하는 자세는 컴퓨팅 시스템 영역의 ＿＿＿＿에 해당한다.",
        "answer": "가치·태도"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "피지컬 컴퓨팅 시스템의 구성요소를 목적에 맞게 선택하는 ＿＿＿＿ 태도는 컴퓨팅 시스템 영역의 가치·태도이다.",
        "answer": "유연한"
      },
      {
        "area": "데이터",
        "question": "데이터를 관리하기 위해서는 아날로그 데이터를 컴퓨터에서 처리할 수 있는 ＿＿＿＿ 형태로 변환하는 과정이 필요하다.",
        "answer": "디지털"
      },
      {
        "area": "데이터",
        "question": "문제 해결을 위해서는 필요한 데이터를 수집하고, 분석하여 ＿＿＿＿를 해석하는 것이 필요하다.",
        "answer": "의미"
      },
      {
        "area": "데이터",
        "question": "수집된 데이터 간의 관계를 파악하고, ＿＿＿＿하는 것은 데이터를 통해 새로운 지식을 찾는 데 도움을 준다.",
        "answer": "구조화"
      },
      {
        "area": "데이터",
        "question": "데이터 영역의 지식·이해 내용에는 디지털 데이터 표현 방법, 데이터 수집과 관리, ＿＿＿＿ 및 해석이 포함된다.",
        "answer": "데이터 구조화"
      },
      {
        "area": "데이터",
        "question": "데이터 영역의 과정·기능에는 다양한 데이터를 디지털 데이터로 표현하기, 데이터를 목적에 맞게 수집·분류·저장하기, 데이터를 구조화하고 ＿＿＿＿하기가 포함된다.",
        "answer": "의미 해석"
      },
      {
        "area": "데이터",
        "question": "실생활의 많은 데이터가 디지털 형태로 변환되어 활용되는 긍정적 측면의 인식, 데이터에 기반하여 현상을 바라보는 ＿＿＿＿은 데이터 영역의 가치·태도이다.",
        "answer": "관점"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "＿＿＿＿은 다양한 설계 전략을 통해 일상생활의 문제를 해결하는 데 활용된다.",
        "answer": "알고리즘"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "자동화를 고려해 설계된 알고리즘은 컴퓨터가 이해할 수 있는 언어로 구현되어 생활을 더욱 편리하게 하는 데 활용된다.",
        "answer": "자동화"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "프로그램 개발은 협력이 필요하며, ＿＿＿＿하는 문화를 통해 더 좋은 프로그램이 개발된다.",
        "answer": "공유"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "알고리즘과 프로그래밍 영역의 지식·이해에는 문제 추상화, 알고리즘 표현 방법, ＿＿＿＿, 논리 연산, 중첩 제어 구조, 함수와 디버깅이 포함된다.",
        "answer": "순차적인 데이터 저장"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "알고리즘과 프로그래밍 영역의 지식·이해에는 문제 추상화, 알고리즘 표현 방법, 순차적인 데이터 저장, ＿＿＿＿, 중첩 제어 구조, 함수와 디버깅이 포함된다.",
        "answer": "논리 연산"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "알고리즘과 프로그래밍 영역의 지식·이해에는 문제 추상화, 알고리즘 표현 방법, 순차적인 데이터 저장, 논리 연산, ＿＿＿＿, 함수와 디버깅이 포함된다.",
        "answer": "중첩 제어 구조"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "문제의 초기 상태, 현재 상태, 목표 상태를 정의하고 해결 가능한 형태로 ＿＿＿＿하기는 과정·기능이다.",
        "answer": "구조화"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "논리 연산, 중첩 제어 구조, 순차적인 데이터 저장을 활용하여 프로그램 작성하기는 알고리즘과 프로그래밍 영역의 ＿＿＿＿이다.",
        "answer": "과정·기능"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "＿＿＿＿를 활용하여 프로그램을 모듈화하고, 프로그램의 오류를 발견하여 수정하기는 과정·기능이다.",
        "answer": "함수"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "문제 분석을 통한 ＿＿＿＿의 중요성을 이해하고, 실생활 문제 해결을 실천하는 자세는 가치·태도이다.",
        "answer": "추상화"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "소프트웨어를 통한 협력과 ＿＿＿＿의 가치는 알고리즘과 프로그래밍 영역의 가치·태도이다.",
        "answer": "공유"
      },
      {
        "area": "인공지능",
        "question": "인공지능 기술로 구현된 ＿＿＿＿는 외부와의 상호 작용을 통해 기존에 해결할 수 없었던 복잡하고 어려운 문제를 해결하는 데 활용된다.",
        "answer": "에이전트"
      },
      {
        "area": "인공지능",
        "question": "인공지능은 데이터를 기반으로 문제 해결을 가능하게 하므로, 인공지능에 사용되는 데이터는 ＿＿＿＿이 없도록 하는 것이 중요하다.",
        "answer": "윤리적 편향성"
      },
      {
        "area": "인공지능",
        "question": "인공지능 영역의 지식·이해에는 인공지능의 개념과 특성, ＿＿＿＿이 포함된다.",
        "answer": "인공지능 시스템"
      },
      {
        "area": "인공지능",
        "question": "인공지능 학습에 필요한 ＿＿＿＿를 수집하여 활용하기는 인공지능 영역의 과정·기능이다.",
        "answer": "데이터"
      },
      {
        "area": "인공지능",
        "question": "인공지능 시스템을 선택하여 문제를 해결하기는 인공지능 영역의 ＿＿＿＿이다.",
        "answer": "과정·기능"
      },
      {
        "area": "인공지능",
        "question": "인공지능 학습에서 데이터로 인한 문제 가능성을 최소화하는 태도는 인공지능 영역의 ＿＿＿＿이다.",
        "answer": "가치·태도"
      },
      {
        "area": "디지털 문화",
        "question": "디지털 기술의 발전에 따라 디지털 사회에서 지켜야 할 규칙과 주의해야 할 ＿＿＿＿가 새롭게 등장한다.",
        "answer": "위험 요소"
      },
      {
        "area": "디지털 문화",
        "question": "디지털 세상에서의 직업이나 진로는 기술의 발전에 따라 변화되므로, 기술과 사회 변화의 관계를 파악하는 것이 중요하다.",
        "answer": "직업이나 진로"
      },
      {
        "area": "디지털 문화",
        "question": "디지털 문화 영역의 지식·이해에는 디지털 사회와 직업, 디지털 윤리, ＿＿＿＿과 저작권이 포함된다.",
        "answer": "개인 정보"
      },
      {
        "area": "디지털 문화",
        "question": "디지털 사회의 특성에 따른 직업의 변화 탐구하기, 디지털 공간에서 지켜야 하는 ＿＿＿＿ 토론하기는 디지털 문화 영역의 과정·기능이다.",
        "answer": "윤리"
      },
      {
        "area": "디지털 문화",
        "question": "디지털 공간에서 나와 다른 사람을 보호하는 방법 탐구하기는 디지털 문화 영역의 ＿＿＿＿이다.",
        "answer": "과정·기능"
      },
      {
        "area": "디지털 문화",
        "question": "디지털 사회로의 변화가 나의 삶과 진로 결정에 미치는 영향력을 탐색하는 자세는 디지털 문화 영역의 ＿＿＿＿이다.",
        "answer": "가치·태도"
      },
      {
        "area": "디지털 문화",
        "question": "디지털 공간에서 함께 살아가기 위한 ＿＿＿＿인 태도는 디지털 문화 영역의 가치·태도이다.",
        "answer": "윤리적"
      }
    ],
    "standard": [
      {
        "area": "컴퓨팅 시스템",
        "question": "[9정01-01] 컴퓨팅 시스템의 구성요소와 동작 원리를 이해하고, ＿＿＿＿의 기능을 분석한다.",
        "answer": "운영 체제"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "[9정01-02] ＿＿＿＿의 개념을 이해하고, 생활 속에서 적용된 사례 조사를 통해 컴퓨팅 시스템의 필요성과 가치를 판단한다.",
        "answer": "피지컬 컴퓨팅"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "문제 해결 목적에 맞는 피지컬 컴퓨팅 구성요소를 선택하여 시스템을 구상한다는 성취기준의 코드는 ＿＿＿＿이다.",
        "answer": "[9정01-03]"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "[9정01-01] 해설에서 컴퓨팅 시스템이 올바르게 동작하기 위해 ＿＿＿＿라는 특수한 형태의 소프트웨어가 필요함을 이해하고, 이것이 컴퓨팅 시스템을 효율적으로 활용하기 위해 수행하는 작업을 설명할 수 있어야 한다.",
        "answer": "운영 체제"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "[9정01-02] 해설에서 다양한 구성요소가 컴퓨팅 시스템에서 고유한 역할을 담당하고 있음을 이해하고, 목적에 맞는 물리적인 장치와 소프트웨어를 결합하여 ＿＿＿＿을 구현하는 과정을 통해 사회의 다양한 영역에서 유용하게 사용될 수 있음을 판단할 수 있어야 한다.",
        "answer": "피지컬 컴퓨팅 시스템"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "고려사항에서 실생활에서 관찰할 수 있는 구체적인 컴퓨팅 시스템의 예시를 적극적으로 활용하여 나의 삶과 컴퓨팅 시스템이 ＿＿＿＿되어 있지 않음을 인식하도록 유도한다.",
        "answer": "괴리"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "피지컬 컴퓨팅 시스템을 구현하는 활동은 하드웨어 구성과 소프트웨어 제작을 함께 진행하게 되어 복잡해질 수 있으므로, 초등학교 실과에서 학습한 수준의 ＿＿＿＿ 활동으로 수행할 수 있도록 미리 구성되어 있는 시스템을 동작하거나 간단한 시스템을 구현하는 난이도로 구성한다.",
        "answer": "프로그래밍"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "피지컬 컴퓨팅 시스템을 구현하기 위한 탐구 중심의 활동을 진행하고, ＿＿＿＿ 형태의 수업을 통해 학생이 시스템을 구성하는 종합적인 활동 경험을 제공하도록 한다.",
        "answer": "프로젝트"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "초등학교 수준에서 프로그래밍 학습이 충분히 이루어지지 않은 학생의 경우 피지컬 컴퓨팅 활동을 통해 ＿＿＿＿ 도구를 활용하여 기초적인 프로그래밍 역량을 충분히 함양할 수 있게 활동을 구성한다.",
        "answer": "물리적인"
      },
      {
        "area": "데이터",
        "question": "[9정02-01] 실생활의 데이터가 디지털 형태로 변환되어 활용되는 긍정적 가치를 탐색하고, 다양한 데이터를 ＿＿＿＿ 형태로 표현한다.",
        "answer": "디지털"
      },
      {
        "area": "데이터",
        "question": "[9정02-02] 문제 해결에 적합한 데이터를 수집하고, 목적에 맞게 구분하여 ＿＿＿＿한다.",
        "answer": "관리"
      },
      {
        "area": "데이터",
        "question": "[9정02-03] 실생활의 데이터를 표, ＿＿＿＿ 등 다양한 형태로 구조화한다.",
        "answer": "다이어그램"
      },
      {
        "area": "데이터",
        "question": "[9정02-04] 사례를 중심으로 데이터 간의 관계를 파악하고, 데이터에 기반하여 ＿＿＿＿를 해석한다.",
        "answer": "의미"
      },
      {
        "area": "데이터",
        "question": "여러 학문 분야의 사례를 중심으로 데이터를 수집·분석하여 ＿＿＿＿으로 문제를 해결한다는 성취기준의 코드는 [9정02-05]이다.",
        "answer": "융합적"
      },
      {
        "area": "데이터",
        "question": "[9정02-01] 해설에서 디지털 형태의 데이터가 갖는 특징과 장점을 탐색하고, 문자, 이미지, 소리, ＿＿＿＿ 등의 데이터를 컴퓨팅 시스템에서 표현하기 위해 사용하는 기법을 활용한다.",
        "answer": "동영상"
      },
      {
        "area": "데이터",
        "question": "[9정02-02] 해설에서 데이터의 종류, 데이터의 의미, 공통점 등 데이터가 가지고 있는 의미나 형식에 따라 데이터를 ＿＿＿＿하여 저장하고 활용할 수 있어야 한다.",
        "answer": "구분"
      },
      {
        "area": "데이터",
        "question": "[9정02-04] 해설에서 수집, 관리하는 데이터를 분석하기 용이한 형태로 나타내고, 이를 소프트웨어나 프로그래밍으로 분석하여 얻은 결과의 가치를 인식하고, 데이터를 기반으로 자신의 주장을 ＿＿＿＿으로 설명할 수 있어야 한다.",
        "answer": "논리적"
      },
      {
        "area": "데이터",
        "question": "실습 환경에 따라 다양한 운영 체제와 파일 시스템을 운용할 수 있으므로 실습 환경에 비교적 독립적인 소프트웨어를 활용하여 디지털 데이터를 탐색하고 저장하여 활용하는 능력이 여러 기기로 ＿＿＿＿될 수 있게 교수·학습을 구성한다.",
        "answer": "전이"
      },
      {
        "area": "데이터",
        "question": "학생의 수준에 따라 데이터를 다양한 시각적 형태로 나타내는 기초적인 활동부터 ＿＿＿＿ 등과 같은 소프트웨어를 활용하여 데이터의 의미를 분석하는 활동까지 단계적으로 교수·학습을 설계한다.",
        "answer": "스프레드시트"
      },
      {
        "area": "데이터",
        "question": "데이터 분석 활동의 전 과정이 프로젝트 기반의 문제 해결 활동, 혹은 ＿＿＿＿의 맥락에서 수행되어 데이터를 기반으로 문제를 해결하는 실제적인 경험을 제공하도록 한다.",
        "answer": "문제기반 학습"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "[9정03-01] 문제의 상태를 정의하고 수행 가능한 형태로 ＿＿＿＿한다.",
        "answer": "구조화"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "[9정03-02] 문제 해결을 위한 추상화의 중요성을 이해하고, ＿＿＿＿를 중심으로 알고리즘을 표현한다.",
        "answer": "핵심요소"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "[9정03-03] 알고리즘의 중요성을 이해하고, 문제를 해결하는 다양한 알고리즘을 ＿＿＿＿한다.",
        "answer": "비교·분석"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "[9정03-04] 사례를 중심으로 문제 해결에 적합한 ＿＿＿＿을 선택하여 알고리즘을 설계한다.",
        "answer": "전략"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "[9정03-05] 데이터를 ＿＿＿＿으로 저장할 수 있는 구조를 활용하여 문제 해결 프로그램을 작성한다.",
        "answer": "순차적"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "[9정03-06] ＿＿＿＿과 중첩 제어 구조를 활용하여 문제를 해결하는 프로그램을 작성한다.",
        "answer": "논리 연산"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "[9정03-07] 프로그램 작성에서 함수를 활용하고, 프로그램 수행 결과를 ＿＿＿＿로 분석하여 오류를 수정한다.",
        "answer": "디버거"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "실생활의 문제를 탐색하여 발견하고, 프로그래밍을 통해 해결한다는 성취기준의 코드는 ＿＿＿＿이다.",
        "answer": "[9정03-08]"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "[9정03-09] 다양한 학문 분야의 문제 해결을 위해 ＿＿＿＿하여 소프트웨어를 개발한다.",
        "answer": "협력"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "[9정03-03] 해설에서 정보 과목에서 추구하는 목표는 문제를 효과적이고 ＿＿＿＿으로 해결하는 알고리즘임을 인식하고, 여러 알고리즘의 장단점을 비교·분석하여 논리적으로 설명할 수 있어야 한다.",
        "answer": "효율적"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "[9정03-05] 해설에서 입력된 데이터를 처리하여 결과 데이터를 도출하는 형태로 프로그램이 제작된다는 개념을 이해하고, ＿＿＿＿나 리스트 등 데이터를 순차적으로 저장할 수 있는 구조를 활용한다.",
        "answer": "배열"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "문제를 해결하는 과정에서 문제 발견, 상태 정의, 핵심요소 추출 등의 추상화 단계를 거쳐 알고리즘을 설계하는 과정을 경험하고, 보고서나 ＿＿＿＿ 등을 활용하여 학생의 사고 과정을 누적하여 기록한다.",
        "answer": "포트폴리오"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "필요에 따라서는 '컴퓨팅 시스템' 영역과 연계하여 피지컬 컴퓨팅 시스템을 설계, 제작하고 이를 동작하게 하는 소프트웨어를 결합하는 형태의 ＿＿＿＿도 제공할 수 있다.",
        "answer": "프로젝트"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "효율적인 알고리즘 설계와 프로그램 작성은 시간, 에너지, ＿＿＿＿ 자원을 절약하는 방안임을 학생들이 인식할 수 있도록 안내한다.",
        "answer": "컴퓨팅 시스템"
      },
      {
        "area": "인공지능",
        "question": "[9정04-01] 인공지능의 개념과 특성을 설명하고 ＿＿＿＿를 구별한다.",
        "answer": "인공지능 소프트웨어"
      },
      {
        "area": "인공지능",
        "question": "[9정04-02] 인공지능 학습에서 데이터의 중요성을 이해하고, 학습에 필요한 데이터를 수집하여 ＿＿＿＿한다.",
        "answer": "분류"
      },
      {
        "area": "인공지능",
        "question": "[9정04-03] 다양한 데이터를 활용하여 인공지능 시스템을 구성하고 ＿＿＿＿한다.",
        "answer": "적용"
      },
      {
        "area": "인공지능",
        "question": "[9정04-04] 인공지능 시스템으로 해결 가능한 문제를 ＿＿＿＿하고, 문제 해결에 적합한 인공지능 시스템을 적용한다.",
        "answer": "발견"
      },
      {
        "area": "인공지능",
        "question": "인공지능 학습에 필요한 데이터의 수집과 활용에서 발생하는 ＿＿＿＿인 문제의 해결 방안을 구상한다는 성취기준은 [9정04-05]이다.",
        "answer": "윤리적"
      },
      {
        "area": "인공지능",
        "question": "[9정04-01] 해설에서 모델, 학습, 데이터 등 인공지능 ＿＿＿＿이 구성되는 원리와 문제를 해결하는 과정에 대해 설명할 수 있어야 한다.",
        "answer": "시스템"
      },
      {
        "area": "인공지능",
        "question": "[9정04-03] 해설에서 이미지, 소리, 글자 등의 데이터를 활용하여 인공지능 시스템을 ＿＿＿＿시키고 학습한 시스템을 활용하여 문제를 해결하는 과정을 수행할 수 있어야 한다.",
        "answer": "학습"
      },
      {
        "area": "인공지능",
        "question": "[9정04-05] 해설에서 인공지능 학습에 필요한 데이터의 수집과 활용에서 나타날 수 있는 여러 가지 현실적인 문제들에 대해 법적, 사회적, ＿＿＿＿으로 타당성을 가지는 해결 방안을 제시할 수 있어야 한다.",
        "answer": "윤리적"
      },
      {
        "area": "인공지능",
        "question": "인공지능 시스템 적용 시, 학생이 익숙하게 활용할 수 있는 프로그래밍 언어를 사용하여 학습에 ＿＿＿＿가 적은 형태로 교수·학습 활동을 구성한다.",
        "answer": "인지적 부하"
      },
      {
        "area": "인공지능",
        "question": "인공지능 윤리는 개인의 성향이나 문제에 대한 관점에 따라 서로 다른 주장을 펼칠 수 있다. 학생의 개별적인 의견을 최대한 존중하고 ＿＿＿＿를 가지고 논리적으로 자신의 의견을 주장할 수 있도록 활동을 구성한다.",
        "answer": "근거"
      },
      {
        "area": "인공지능",
        "question": "인공지능과 관련된 여러 사례를 경험하게 하고 활동을 통해 학습자의 인공지능에 대한 깊이 있는 이해가 ＿＿＿＿될 수 있도록 교수·학습을 구성한다.",
        "answer": "내면화"
      },
      {
        "area": "디지털 문화",
        "question": "[9정05-01] 디지털 사회의 특성을 탐구하고, 사회 변화에 따른 ＿＿＿＿의 변화를 탐구한다.",
        "answer": "직업"
      },
      {
        "area": "디지털 문화",
        "question": "[9정05-02] 디지털 사회의 구성원으로서 편리하고 안전한 생활을 위한 규칙에 대해 ＿＿＿＿으로 논의하고 실천 방안을 수립한다.",
        "answer": "민주적"
      },
      {
        "area": "디지털 문화",
        "question": "사례를 중심으로 디지털 공간에서 함께 살아가기 위해 개인 정보 및 권리와 ＿＿＿＿을 보호하는 실천 방법을 탐구한다는 성취기준의 코드는 [9정05-03]이다.",
        "answer": "저작권"
      },
      {
        "area": "디지털 문화",
        "question": "[9정05-02] 해설에서 디지털 사회를 안전하고 편리하게 살아가는 데 필요한 정보 윤리, 사이버 폭력 및 범죄 예방에 대한 기본적인 소양을 갖추고 스마트폰 중독, 인터넷 중독, ＿＿＿＿ 등의 구체적인 사례를 분석할 수 있어야 한다.",
        "answer": "게임 과몰입"
      },
      {
        "area": "디지털 문화",
        "question": "정보 과목의 다른 내용 영역에서 자신이 실제로 학습한 내용을 바탕으로 디지털 사회를 이해하고 자신의 진로 계획을 수립할 수 있도록 ＿＿＿＿ 교육을 고려한 교수·학습을 구성한다.",
        "answer": "진로 연계"
      },
      {
        "area": "디지털 문화",
        "question": "민주시민 교육의 일환으로 디지털 사회에서 발생하는 여러 문제에 대한 다양한 견해가 있을 수 있음을 인정하고, 다른 사람의 의견을 ＿＿＿＿하는 논의 환경을 조성하도록 한다.",
        "answer": "존중"
      }
    ],
    "teach": [
      {
        "area": "",
        "question": "실제적인 삶의 맥락에서 컴퓨팅을 통해 문제를 해결하도록 하는 학습 과제를 제시하여 학습자가 과제를 스스로 해결하는 과정에서 자연스럽게 컴퓨팅 사고력, 디지털 문화 소양, ＿＿＿＿ 소양을 함양할 수 있도록 지도한다.",
        "answer": "인공지능"
      },
      {
        "area": "",
        "question": "학습자의 흥미와 다양성을 고려하여 학습 소재, 학습 환경 및 학습 과정에 대한 선택의 기회를 제공하고, 교수·학습의 설계 과정에 학습자 참여 기회를 증진하는 등 ＿＿＿＿ 교수·학습을 통해 역량 함양을 위한 깊이 있는 학습 지도 방안을 구성한다.",
        "answer": "학습자 맞춤형"
      },
      {
        "area": "",
        "question": "영역별 교수·학습에 필요한 디지털 역량을 탐색하고 학생의 ＿＿＿＿ 수준을 파악하여 교수·학습을 진행하는 데 어려움이 없도록 추가적인 교육 기회를 제공한다.",
        "answer": "디지털 역량"
      },
      {
        "area": "",
        "question": "정보 과목의 지식 이해, 과정 기능을 활용하여 민주시민교육, ＿＿＿＿ 교육 등 현 시대가 당면한 여러 사회문제와 더불어 지속가능발전 등의 범교과 주제를 교수·학습 과제로 제시하여 주도성 있는 문제 해결 경험을 제공한다.",
        "answer": "생태전환"
      },
      {
        "area": "",
        "question": "'정보' 과목 내의 영역, 다른 교과 및 비교과 활동과의 ＿＿＿＿을 통해 정보 관련 역량의 확장을 꾀하고 학생의 역량이 다양한 분야에 전이되도록 한다.",
        "answer": "통합"
      },
      {
        "area": "",
        "question": "내용 영역의 배열순서가 반드시 교수·학습의 순서를 의미하는 것은 아니므로, 교수·학습 계획을 수립하거나 평가를 준비할 때는 학생에게 제공할 문제 상황, 문제의 난이도, 학생의 ＿＿＿＿, 학습 환경 등을 고려하여 내용이나 순서 등을 재구성할 수 있다.",
        "answer": "준비 상태"
      },
      {
        "area": "",
        "question": "학습자의 선행 지식과 총체적인 과제 진행을 고려하여 하위 학년군과 상위 학년군의 ＿＿＿＿을 적절히 활용할 수 있다.",
        "answer": "성취기준"
      },
      {
        "area": "",
        "question": "교과 역량을 함양하기 위해 문제기반학습, 프로젝트 기반학습, ＿＿＿＿, 짝 프로그래밍, 탐구학습 등 각 영역의 핵심 아이디어를 습득하는 데 적절한 교수·학습 방법을 선택하여 활용한다.",
        "answer": "디자인기반학습"
      },
      {
        "area": "",
        "question": "디지털 교육 환경에 적응할 수 있도록 온오프라인 연계 수업, 다양한 디지털 도구의 활용 등을 통해 디지털 도구에 대한 ＿＿＿＿은 최소화하고, 활용에 대한 경험은 높일 수 있도록 활동을 구성한다.",
        "answer": "인지적 부담"
      },
      {
        "area": "",
        "question": "온라인 교실, 다양한 커뮤니티 서비스 등을 활용하여 학생이 수업 현장에 있지 않더라도 ＿＿＿＿이 발생하지 않도록 교수·학습을 제공한다.",
        "answer": "학습 결손"
      },
      {
        "area": "",
        "question": "내용 영역별로 프로그래밍을 통한 문제 해결 과정을 포함하도록 하여 ＿＿＿＿을 문제 해결에 적용하는 충분한 경험을 하도록 교수·학습을 구성한다.",
        "answer": "컴퓨팅 시스템"
      },
      {
        "area": "",
        "question": "학습 목표를 효과적으로 달성하기 위해 학급 내에서 ＿＿＿＿를 고려한 소집단을 구성하여 교수·학습을 전개할 수 있다.",
        "answer": "개인차"
      }
    ],
    "evaluation": [
      {
        "area": "",
        "question": "평가 항목은 컴퓨팅 사고력, 디지털 문화 소양, 인공지능 소양의 ＿＿＿＿를 기반으로 구체화한다.",
        "answer": "하위 요소"
      },
      {
        "area": "",
        "question": "평가 내용은 지식 이해뿐 아니라, 과정 기능, 가치 태도의 측면 등을 다면적으로 반영하고 ＿＿＿＿을 중시하는 평가를 통해 학생의 성장과 발달을 돕는 평가를 실현한다.",
        "answer": "과정"
      },
      {
        "area": "",
        "question": "구체적인 평가 ＿＿＿＿을 학생과 함께 구성하는 과정을 통해 학생이 자신의 학습 수준을 파악하고 스스로 학습을 성찰할 수 있는 기회를 제공하여, 적극적이고 능동적인 학습이 이루어지도록 한다.",
        "answer": "루브릭"
      },
      {
        "area": "",
        "question": "단순하고 지엽적인 지식의 평가보다는 문제를 해결하는 과정을 통합적으로 관찰하고 평가할 수 있는 계획을 수립한다.",
        "answer": "통합적으로"
      },
      {
        "area": "",
        "question": "성취기준을 분석하고 재구성하여 지필평가에 국한하지 않고, 학생의 성장에 기여할 수 있는 평가 ＿＿＿＿를 계획한다.",
        "answer": "포트폴리오"
      },
      {
        "area": "",
        "question": "관찰 평가, 서술형평가, 수행평가 등을 활용하거나, 자기 평가, ＿＿＿＿ 등과 같은 다면적 평가를 실행한다.",
        "answer": "동료 평가"
      },
      {
        "area": "",
        "question": "평가 내용이나 방법에 따라 다양한 디지털 도구(프로그램 자동 평가시스템, ＿＿＿＿(LMS) 등)를 활용할 수 있다.",
        "answer": "학습관리시스템"
      },
      {
        "area": "",
        "question": "평가 이전에 학생이 디지털 도구를 다룰 수 있도록 교육하여 평가의 ＿＿＿＿이 없도록 계획한다.",
        "answer": "불이익"
      },
      {
        "area": "",
        "question": "개념적이거나 기능적으로 명확하게 파악할 수 있는 부분은 ＿＿＿＿ 평가를, 결과물의 품질이나 심미적 부분을 평가할 때는 정성적 평가를 실시한다.",
        "answer": "정량적"
      },
      {
        "area": "",
        "question": "개념적이거나 기능적으로 명확하게 파악할 수 있는 부분은 정량적 평가를, 결과물의 품질이나 심미적 부분을 평가할 때는 ＿＿＿＿ 평가를 실시한다.",
        "answer": "정성적"
      }
    ]
  },
  "high-info": {
    "goal": [
      {
        "area": "",
        "question": "'정보(Informatics)'과는 인공지능으로 정의되는 사회에서 데이터와 정보로 인한 ＿＿＿＿ 세상의 변화를 인식하고, 정보의 사회적 가치를 탐구하는 교과이다.",
        "answer": "디지털"
      },
      {
        "area": "",
        "question": "'정보'과는 정보를 처리하는 다양한 원리와 기술에 기반한 ＿＿＿＿을 바탕으로 실생활 및 다양한 학문 분야의 문제를 해결하는 능력과 태도를 기르는 교과이다.",
        "answer": "컴퓨팅 사고력"
      },
      {
        "area": "",
        "question": "'정보'는 디지털 대전환 시대의 국가사회적 요구에 부응하여, ＿＿＿＿을 활용한 문제 해결을 위해 사회 구성원이 갖추어야 할 필수 역량을 제공한다.",
        "answer": "컴퓨팅"
      },
      {
        "area": "",
        "question": "'정보'의 학문적 기저는 컴퓨터에서 처리되는 데이터와 정보의 원리, 컴퓨팅 시스템을 설계하고 구현하는 기술과 방법, 정보를 다루는 ＿＿＿＿에 대한 이해 등을 포괄하고 있다.",
        "answer": "인간 사회"
      },
      {
        "area": "",
        "question": "'정보'는 컴퓨터 과학뿐 아니라 데이터 과학, 인공지능, 정보기술, 정보시스템, ＿＿＿＿ 공학 등의 분야를 포괄하는 정보학에 대한 기본 개념과 원리를 기반으로 한다.",
        "answer": "소프트웨어"
      },
      {
        "area": "",
        "question": "정보 교과의 특성은 사회 각 분야에서 요구되는 소프트웨어와 인공지능에 대한 기본 소양을 갖추고, 다양한 학문 분야에서 문제를 ＿＿＿＿으로 해결하는 인재 양성에 도움을 준다.",
        "answer": "창의적"
      },
      {
        "area": "",
        "question": "고등학교 '정보'는 미래 사회가 요구하는 데이터에 대한 이해를 기반으로 소프트웨어와 인공지능에 대한 기본 역량과 ＿＿＿＿을 갖도록 한다.",
        "answer": "자기주도성"
      },
      {
        "area": "",
        "question": "고등학교 '정보'는 컴퓨팅을 통한 문제 해결을 전제로 문제를 발견, 분석, 해결해 가는 ＿＿＿＿에 기반하여 여러 역량을 갖춘 디지털 민주시민으로 성장하게 한다.",
        "answer": "컴퓨팅 사고력"
      },
      {
        "area": "",
        "question": "고등학교 '정보'는 지식정보처리, 창의적 사고, 타인과 협업하고 공유하는 협력적 소통 역량과 ＿＿＿＿ 등을 갖춘 디지털 민주시민으로 성장하게 한다.",
        "answer": "공동체 역량"
      },
      {
        "area": "",
        "question": "고등학교 '정보'는 중학교 '정보'와 연계해 불확실한 미래 사회의 문제를 해결하기 위한 사고력을 강화하고, 정보 과목의 내용이 필요한 분야의 ＿＿＿＿를 탐색하여 자신을 성장시키는 데 도움이 되는 능력과 태도를 함양한다.",
        "answer": "진로"
      },
      {
        "area": "",
        "question": "고등학교 '정보'는 진로 선택 과목과 연계하여 인공지능 기술에 대한 전반적인 이해, 사회 변화를 주도하는 데이터의 분석과 가치 이해, 더 좋은 사회를 만드는 데 기여하는 ＿＿＿＿ 프로젝트 등에 참여하고 협업과 공유의 가치를 실천하도록 한다.",
        "answer": "소프트웨어"
      },
      {
        "area": "",
        "question": "고등학교 '정보'는 인공지능과 더불어 살아가게 될 미래 사회에서 독립적으로 살아가는 데 필요한 정보 관련 능력을 함양하여 컴퓨팅 장치, 정보 처리, ＿＿＿＿ 등과 같은 '정보'과의 전문 지식을 기반으로 컴퓨팅 사고력을 함양할 수 있도록 하는 데 중점을 둔다.",
        "answer": "인공지능"
      },
      {
        "area": "",
        "question": "(1) 디지털 세상을 연결하는 컴퓨팅 시스템 간의 연결 원리를 파악하고, 정보를 다루는 시스템에 의해 처리 생성된 결과가 공유되도록 하는 ＿＿＿＿ 능력을 기른다.",
        "answer": "시스템 제어"
      },
      {
        "area": "",
        "question": "(2) 컴퓨팅을 활용한 문제 해결을 위해 목적에 맞는 데이터를 수집하고, 데이터 간의 관계를 파악하여 구조화하고, ＿＿＿＿를 처리하고 시각화할 수 있는 능력을 기른다.",
        "answer": "빅데이터"
      },
      {
        "area": "",
        "question": "(3) 다양한 학문 분야의 문제 해결에 필요한 데이터의 관계를 모델링하고 알고리즘을 효율적으로 설계하여 프로그램으로 구현, 평가, 개선하는 과정에서 ＿＿＿＿의 문화를 실천하는 태도를 기른다.",
        "answer": "협력과 공유"
      },
      {
        "area": "",
        "question": "(4) ＿＿＿＿의 관점에서 인공지능을 이해하고, 기계학습을 통한 인공지능으로 문제를 해결하는 방법을 체득하고 적용하는 능력을 기른다.",
        "answer": "지능 에이전트"
      },
      {
        "area": "",
        "question": "(5) 디지털 기술로 인한 사회의 발전과 변화를 이해하고, ＿＿＿＿와 정보보안의 중요성을 인식하여 실천하는 태도와 능력을 기른다.",
        "answer": "정보 보호"
      }
    ],
    "content": [
      {
        "area": "컴퓨팅 시스템",
        "question": "하드웨어와 소프트웨어의 유기적 연결을 통해 동작하는 ＿＿＿＿은 사회적, 기술적 가치를 높이는 데 활용된다.",
        "answer": "컴퓨팅 시스템"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "네트워크는 여러 개의 컴퓨팅 시스템 간 연결의 원리를 파악하고, 통신을 통해 ＿＿＿＿를 가능하게 한다.",
        "answer": "데이터 공유"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "컴퓨팅 시스템 영역의 지식은 네트워크의 구성, ＿＿＿＿ 시스템의 구성 및 동작 원리이다.",
        "answer": "사물인터넷"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "컴퓨팅 시스템 영역의 과정 기능으로 컴퓨팅 시스템 간 네트워크를 구성하고 ＿＿＿＿ 설정하기가 있다.",
        "answer": "공유"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "컴퓨팅 시스템 영역의 과정 기능으로 문제 해결에 적합한 ＿＿＿＿ 시스템 설계하기가 있다.",
        "answer": "사물인터넷"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "컴퓨팅 시스템 영역의 가치·태도로 협력적 의사 소통을 위해 ＿＿＿＿ 환경을 적극적으로 활용하는 자세가 있다.",
        "answer": "네트워크"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "컴퓨팅 시스템 영역의 가치·태도로 사물인터넷 시스템으로 인한 사회 변화에 대처하는 ＿＿＿＿ 태도가 있다.",
        "answer": "능동적"
      },
      {
        "area": "데이터",
        "question": "데이터의 압축과 ＿＿＿＿는 데이터를 효율적으로 관리하고 보호하는 데 도움을 준다.",
        "answer": "암호화"
      },
      {
        "area": "데이터",
        "question": "수집된 데이터 간의 관계를 파악하여 구조화하는 것은 데이터를 통해 새로운 ＿＿＿＿을 찾는 데 도움을 준다.",
        "answer": "지식"
      },
      {
        "area": "데이터",
        "question": "빅데이터 기술을 활용하여 데이터를 수집, 처리, 관리하는 과정에서 ＿＿＿＿인 문제를 고려해서 수행해야 올바른 결과가 도출된다.",
        "answer": "윤리적"
      },
      {
        "area": "데이터",
        "question": "데이터 영역의 지식은 디지털 데이터 압축과 암호화, ＿＿＿＿ 개념과 분석이다.",
        "answer": "빅데이터"
      },
      {
        "area": "데이터",
        "question": "데이터 영역의 과정 기능으로 디지털 데이터 압축의 효율성을 분석하고 평가하기, ＿＿＿＿ 활용사례 탐색하기 등이 있다.",
        "answer": "암호화"
      },
      {
        "area": "데이터",
        "question": "데이터 영역의 과정 기능으로 빅데이터 기술을 활용하여 데이터를 분석하고 ＿＿＿＿하기가 있다.",
        "answer": "시각화"
      },
      {
        "area": "데이터",
        "question": "데이터 영역의 가치·태도로 효율적인 데이터 표현의 긍정적 측면을 활용하려는 자세, 데이터를 안전하게 관리하고 보호하는 태도, 빅데이터 분석의 가치에 대한 사회적, ＿＿＿＿ 측면의 성찰이 있다.",
        "answer": "윤리적"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "문제를 효율적으로 해결하기 위해서는 문제를 ＿＿＿＿하고, 프로그래밍을 위한 알고리즘을 설계한다.",
        "answer": "추상화"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "＿＿＿＿을 하기 위해 문제 해결에 필요한 데이터 간의 관계를 분석하고, 정의한다.",
        "answer": "데이터 모델링"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "프로그래밍을 통한 ＿＿＿＿는 다양한 학문 분야의 문제를 해결하는 데 도움을 준다.",
        "answer": "자동화"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "알고리즘과 프로그래밍 영역의 지식에는 문제 분해와 모델링, 정렬, 탐색 알고리즘, 자료형, 표준입출력과 파일입출력, ＿＿＿＿ 활용, 제어 구조의 응용, 클래스와 인스턴스가 있다.",
        "answer": "다차원 데이터"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "알고리즘과 프로그래밍 영역의 과정 기능으로 복잡한 문제를 해결하기 위해 제어 구조와 ＿＿＿＿ 구조를 복합적으로 활용하기가 있다.",
        "answer": "다차원 데이터"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "알고리즘과 프로그래밍 영역의 과정 기능으로 ＿＿＿＿를 정의하고 인스턴스를 생성하여 문제 해결에 적합한 객체를 구현하기가 있다.",
        "answer": "클래스"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "알고리즘과 프로그래밍 영역의 가치·태도로 알고리즘 효율의 가치와 영향력을 인식하고 적극적으로 ＿＿＿＿하는 태도가 있다.",
        "answer": "탐구"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "알고리즘과 프로그래밍 영역의 가치·태도로 사회의 민주시민으로서 ＿＿＿＿의 중요성을 인식하는 자세가 있다.",
        "answer": "협력적 문제 해결력"
      },
      {
        "area": "인공지능",
        "question": "＿＿＿＿는 외부와의 상호 작용을 통해 기존에 해결할 수 없었던 복잡하고 어려운 문제를 해결하는 데 활용된다.",
        "answer": "지능 에이전트"
      },
      {
        "area": "인공지능",
        "question": "기계학습 기반의 인공지능을 구현하기 위해서는 문제 해결에 적합한 데이터와 ＿＿＿＿ 모델을 활용한다.",
        "answer": "기계학습"
      },
      {
        "area": "인공지능",
        "question": "인공지능 영역의 지식은 지능 에이전트의 역할, ＿＿＿＿의 개념과 유형이다.",
        "answer": "기계학습"
      },
      {
        "area": "인공지능",
        "question": "인공지능 영역의 과정 기능으로 인공지능 제품이나 서비스에서 ＿＿＿＿의 역할 탐색하기가 있다.",
        "answer": "지능 에이전트"
      },
      {
        "area": "인공지능",
        "question": "인공지능 영역의 가치·태도로 인간과 인공지능의 관계에 대한 올바른 ＿＿＿＿이 있다.",
        "answer": "인식"
      },
      {
        "area": "인공지능",
        "question": "인공지능 영역의 가치·태도로 사회문제를 해결하기 위해 ＿＿＿＿을 적극적으로 활용하는 자세가 있다.",
        "answer": "기계학습"
      },
      {
        "area": "디지털 문화",
        "question": "디지털 세상에서의 직업이나 진로는 기술의 발전에 따라 변화되므로, 기술과 ＿＿＿＿의 관계를 파악하는 것이 중요하다.",
        "answer": "사회 변화"
      },
      {
        "area": "디지털 문화",
        "question": "디지털 사회를 안전하게 살아가기 위해서는 정보 보호와 ＿＿＿＿의 규칙을 우리 모두가 지켜야 한다.",
        "answer": "정보보안"
      },
      {
        "area": "디지털 문화",
        "question": "디지털 문화 영역의 지식은 디지털 사회와 진로, ＿＿＿＿와 보안이다.",
        "answer": "정보 보호"
      },
      {
        "area": "디지털 문화",
        "question": "디지털 문화 영역의 과정 기능으로 디지털 기술의 발전에 따른 사회 변화와 연계하여 ＿＿＿＿하기가 있다.",
        "answer": "진로설계"
      },
      {
        "area": "디지털 문화",
        "question": "디지털 문화 영역의 가치·태도로 미래 사회의 발전 방향에 대해 예측하고 통찰하는 자세, 올바른 정보 보호 및 ＿＿＿＿ 의식이 있다.",
        "answer": "보안"
      }
    ],
    "standard": [
      {
        "area": "컴퓨팅 시스템",
        "question": "[12정01-01] ＿＿＿＿ 네트워크의 특성을 이해하고, 컴퓨팅 시스템 간 공유, 협력, 소통을 위한 네트워크 환경을 구성한다.",
        "answer": "유무선"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "[12정01-02] 사물인터넷의 구성과 동작 원리를 분석하고, 사물인터넷 기술로 인한 개인의 삶과 ＿＿＿＿의 변화를 예측한다.",
        "answer": "사회"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "문제 해결에 적합한 ＿＿＿＿ 컴퓨팅 시스템 장치를 선택하여 사물인터넷 시스템을 설계하는 성취기준은 [12정01-03]이다.",
        "answer": "피지컬"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "네트워크의 개념과 구성요소, 유·무선 통신의 특성 등을 구체적인 예를 들어 설명하는 것은 성취기준 ＿＿＿＿의 해설이다.",
        "answer": "[12정01-01]"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "네트워크 이론이나 유·무선 통신 등의 개념적인 내용보다는 사물인터넷 장치를 이해하고 구성하기 위한 관점에서 유·무선 네트워크를 활용할 수 있도록 ＿＿＿＿을 구성하도록 한다.",
        "answer": "교수·학습"
      },
      {
        "area": "컴퓨팅 시스템",
        "question": "사물인터넷 시스템 구현 시 복잡한 통신 및 회로 설계보다는 네트워크를 통한 데이터의 이동과 이를 활용한 창의적인 아이디어를 구현하는 과정에 중점을 두어 활동을 구성하고, 설계 과정과 구현 결과를 다양한 방식으로 누적한 후 평가하여 ＿＿＿＿을 보장하도록 한다.",
        "answer": "최소 성취수준"
      },
      {
        "area": "데이터",
        "question": "[12정02-01] 디지털 데이터 압축의 개념과 필요성을 이해하고, 압축의 ＿＿＿＿을 분석하여 평가한다.",
        "answer": "효율성"
      },
      {
        "area": "데이터",
        "question": "[12정02-02] ＿＿＿＿의 개념을 이해하고, 이를 활용하여 데이터를 안전하게 관리하는 사례를 비교·분석한다.",
        "answer": "암호화"
      },
      {
        "area": "데이터",
        "question": "[12정02-03] ＿＿＿＿의 개념과 특징에 대한 이해를 바탕으로, 문제 해결에 적합한 데이터를 수집한다.",
        "answer": "빅데이터"
      },
      {
        "area": "데이터",
        "question": "빅데이터 분석 도구를 활용하여 데이터를 시각화하고 그 의미와 가치를 해석하는 성취기준은 ＿＿＿＿이다.",
        "answer": "[12정02-04]"
      },
      {
        "area": "데이터",
        "question": "문자, 이미지, 소리 데이터 등의 기본적인 압축 원리를 이해하고 원본 데이터와 품질 및 용량 분석, 압축 방법 간의 ＿＿＿＿을 비교·분석할 수 있어야 한다는 것은 [12정02-01]의 해설이다.",
        "answer": "효율성"
      },
      {
        "area": "데이터",
        "question": "비교적 간단한 치환형, 전치형 등의 암호 기법을 활용하여 암호화, ＿＿＿＿의 과정을 이해하고, 암호화의 중요성과 필요성을 설명할 수 있어야 한다.",
        "answer": "복호화"
      },
      {
        "area": "데이터",
        "question": "압축이나 암호화가 실제로 구현되는 과정을 프로그래밍 과정에서 확인할 수 있도록 ＿＿＿＿ 영역과 연계하여 교수·학습 과정을 설계하도록 한다.",
        "answer": "알고리즘과 프로그래밍"
      },
      {
        "area": "데이터",
        "question": "피지컬 컴퓨팅이나 스마트 기기를 활용한 센서 데이터 수집, 설문조사 등을 통한 직접 수집, 공개된 공공 데이터나 민간 데이터 활용 등 다양한 ＿＿＿＿ 방법을 경험할 수 있도록 활동을 구성한다.",
        "answer": "데이터 수집"
      },
      {
        "area": "데이터",
        "question": "데이터의 생성, 저장, 송·수신, 활용 등의 활동에 디지털 자원과 전기 에너지가 소요됨을 인식하고, 데이터 압축 및 암호화를 통해 컴퓨팅 자원 절약과 ＿＿＿＿ 실천에 영향을 미칠 수 있음을 안내하도록 한다.",
        "answer": "탄소중립"
      },
      {
        "area": "데이터",
        "question": "수집한 데이터와 분석 방법에 따라 특정 문제에 대한 해석이 다를 수 있음을 인정하고, 데이터에 기반하여 자신의 주장을 펼치는 민주적인 ＿＿＿＿ 문화를 조성하도록 한다.",
        "answer": "토의·토론"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "[12정03-01] 복잡한 문제를 해결 가능한 작은 문제로 분해하고 ＿＿＿＿한다.",
        "answer": "모델링"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "데이터를 정렬하는 다양한 알고리즘의 특징과 효율을 비교·분석하는 성취기준은 ＿＿＿＿이다.",
        "answer": "[12정03-02]"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "[12정03-03] 데이터를 ＿＿＿＿하는 다양한 알고리즘의 특징과 효율을 비교·분석한다.",
        "answer": "탐색"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "[12정03-04] ＿＿＿＿의 종류와 특성을 알고, 적합한 것을 선택하여 프로그램을 작성한다.",
        "answer": "자료형"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "[12정03-05] 표준입출력과 ＿＿＿＿을 활용한 프로그램을 작성한다.",
        "answer": "파일입출력"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "[12정03-06] ＿＿＿＿ 구조를 활용한 프로그램을 작성한다.",
        "answer": "다차원 데이터"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "[12정03-07] 다양한 ＿＿＿＿를 복합적으로 활용한 프로그램을 작성한다.",
        "answer": "제어 구조"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "객체를 구현하는 클래스와 ＿＿＿＿를 활용하여 프로그램을 작성하는 성취기준은 [12정03-08]이다.",
        "answer": "인스턴스"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "[12정03-09] 실생활 및 다양한 학문 분야의 문제 해결을 위한 프로그램을 ＿＿＿＿으로 설계·구현한다.",
        "answer": "협력적"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "문제 해결을 위한 프로그램의 성능을 평가하고 공유하는 성취기준은 ＿＿＿＿이다.",
        "answer": "[12정03-10]"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "복잡한 문제를 분석하는 단계에서 좀 더 작은 문제로 분해하는 과정을 수행하며, 해결하기 용이하도록 단순화나 구조화하는 ＿＿＿＿ 단계를 수행할 수 있어야 한다.",
        "answer": "모델링"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "여러 가지 정렬, 탐색 알고리즘을 적용하여 실생활의 간단한 데이터의 정렬, 탐색 문제를 해결하고, 문제에 따라 알고리즘의 ＿＿＿＿이 다를 수 있음을 설명할 수 있어야 한다.",
        "answer": "효율성"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "실생활의 사례를 활용하여 ＿＿＿＿의 기본 개념을 이해하고 필요성을 설명할 수 있어야 하며, 클래스와 객체를 생성하여 문제 해결에 활용할 수 있어야 한다.",
        "answer": "객체 지향"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "문제 분해, 모델링, 알고리즘 설계 등의 추상화 과정 및 프로그램 작성, 실행 결과 평가, 오류 수정 등의 자동화 과정이 유기적으로 연결되도록 ＿＿＿＿으로 교수·학습을 제시하고 과정 전반을 평가하도록 한다.",
        "answer": "나선형"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "다차원 데이터 구조 학습 과정에서 프로그래밍 언어에 따라 2차원 혹은 그 이상의 배열이나 ＿＿＿＿를 활용하도록 한다.",
        "answer": "리스트"
      },
      {
        "area": "알고리즘과 프로그래밍",
        "question": "프로그래밍 학습 시 최소 성취수준을 보장하기 위하여 학습 개념을 우선 이해할 수 있도록 미리 제작된 코드를 제공하거나, 프로그래밍 언어에서 활용할 수 있는 여러 ＿＿＿＿를 활용하는 방안을 구상하도록 한다.",
        "answer": "라이브러리"
      },
      {
        "area": "인공지능",
        "question": "[12정04-01] ＿＿＿＿의 개념과 특성을 이해하고, 인간과 인공지능의 관계를 분석한다.",
        "answer": "지능 에이전트"
      },
      {
        "area": "인공지능",
        "question": "기계학습의 개념을 이해하고, 지도학습과 ＿＿＿＿의 차이를 비교·분석하는 성취기준은 [12정04-02]이다.",
        "answer": "비지도학습"
      },
      {
        "area": "인공지능",
        "question": "[12정04-03] 기계학습을 활용하여 해결할 수 있는 문제와 그렇지 않은 문제를 구분하고, ＿＿＿＿ 해결에 기계학습을 적용한다.",
        "answer": "사회문제"
      },
      {
        "area": "인공지능",
        "question": "에이전트와 지능 에이전트를 인식, 학습, 추론, ＿＿＿＿ 등 인공지능 관점에서 구분하고, 인간과 인공지능의 역할에 대해 탐색할 수 있어야 한다.",
        "answer": "행동"
      },
      {
        "area": "인공지능",
        "question": "회귀, 분류, ＿＿＿＿ 등 기계학습 유형을 이해하고, 이를 통해 해결할 수 있는 실생활 및 사회문제를 선별하여 해결책을 적용할 수 있어야 한다.",
        "answer": "군집"
      },
      {
        "area": "인공지능",
        "question": "인공지능 에이전트를 학습자가 직접 프로그래밍하기는 어려우므로 학습자가 접근하기 쉬운 인공지능 플랫폼이나 ＿＿＿＿ 라이브러리를 활용하여 기계학습 모델을 구현하도록 한다.",
        "answer": "기계학습"
      },
      {
        "area": "인공지능",
        "question": "기계학습으로 해결 가능한 ＿＿＿＿(SDGs) 관련 문제를 탐색하여 인공지능이 사회 문제 해결에 도움이 되는 경험을 제공하도록 한다.",
        "answer": "지속가능발전목표"
      },
      {
        "area": "디지털 문화",
        "question": "[12정05-01] 디지털 기술이 사회에 미치는 영향력을 분석하고 발전 방향을 예측하여 ＿＿＿＿를 설계한다.",
        "answer": "진로"
      },
      {
        "area": "디지털 문화",
        "question": "보호해야 할 정보와 공유해야 할 정보를 구분하고, 올바른 정보 보호 방법을 실천하는 성취기준은 ＿＿＿＿이다.",
        "answer": "[12정05-02]"
      },
      {
        "area": "디지털 문화",
        "question": "[12정05-03] ＿＿＿＿의 필요성을 이해하고, 보안 기술을 활용하여 디지털 윤리를 실천한다.",
        "answer": "정보보안"
      },
      {
        "area": "디지털 문화",
        "question": "정보 보호와 정보공개의 가치와 영향력을 인식하고, 개인 정보 보호, 오·남용 방지 대책 등 실사례를 탐색하며 ＿＿＿＿을 실천할 수 있어야 한다는 것은 [12정05-02]의 해설이다.",
        "answer": "정보 보호 방법"
      },
      {
        "area": "디지털 문화",
        "question": "사물인터넷, 클라우드, 빅데이터, 인공지능 등 학습 과정을 통해 생성한 결과물을 바탕으로 정보과학기술과 자신의 ＿＿＿＿와의 연관성을 탐색할 수 있는 활동을 제시한다.",
        "answer": "진로"
      },
      {
        "area": "디지털 문화",
        "question": "개인 정보 보호 및 보안의 중요성을 이해하기 위해 개인 암호 설정 및 변경, 기기 및 클라우드 접근제어, ＿＿＿＿ 등 학습자가 실천할 수 있는 활동을 제시한다.",
        "answer": "바이러스 백신"
      },
      {
        "area": "디지털 문화",
        "question": "디지털 사회에서 발생하는 여러 문제에 대한 다양한 견해가 있을 수 있음을 인식하고, 디지털 환경에서 지켜야 할 규칙을 ＿＿＿＿ 방식으로 함께 수립해 볼 수 있는 활동을 제시하도록 한다.",
        "answer": "민주적인"
      }
    ],
    "teach": [
      {
        "area": "",
        "question": "(가) 실제적인 삶의 맥락에서 컴퓨팅을 통해 문제를 해결하도록 하는 학습 과제를 제시하여 학습자가 스스로 해결하는 과정에서 자연스럽게 컴퓨팅 사고력, 디지털 문화 소양, ＿＿＿＿ 소양을 함양할 수 있도록 지도한다.",
        "answer": "인공지능"
      },
      {
        "area": "",
        "question": "(나) 학습자의 흥미와 다양성을 고려하여 학습 소재, 학습 환경 및 학습 과정에 대한 선택의 기회를 제공하고, 학습자 맞춤형 교수·학습을 통해 역량 함양을 위한 ＿＿＿＿ 있는 학습 지도 방안을 구성한다.",
        "answer": "깊이"
      },
      {
        "area": "",
        "question": "(다) 정보 과목의 지식 이해, 과정 기능을 활용하여 민주시민교육, ＿＿＿＿ 교육 등 현 시대가 당면한 여러 사회문제와 지속가능발전 등의 범교과 주제를 교수·학습 과제로 제시한다.",
        "answer": "생태전환"
      },
      {
        "area": "",
        "question": "(라) 내용 영역의 배열순서는 예시의 성격으로 중학교에서 이수한 학생의 수준, 학교의 학습 환경 등을 고려하여 교육과정을 자율적으로 ＿＿＿＿한다.",
        "answer": "재구성"
      },
      {
        "area": "",
        "question": "(마) 온라인 학습 플랫폼을 활용하는 디지털 기반 ＿＿＿＿을 활용하여 언제 어디서나 학습의 연장이 가능하도록 한다.",
        "answer": "학습 이력"
      },
      {
        "area": "",
        "question": "(마) 네트워크 기반의 온라인 활동을 통해 ＿＿＿＿으로 문제를 해결할 수 있는 역량을 함양하도록 활동을 구성한다.",
        "answer": "협력적"
      },
      {
        "area": "",
        "question": "(가) 정보 교과 역량을 함양하기 위해 문제기반학습, 프로젝트 기반학습, ＿＿＿＿, 짝 프로그래밍, 탐구학습 등 적절한 교수·학습 방법을 선택하여 활용한다.",
        "answer": "디자인기반학습"
      },
      {
        "area": "",
        "question": "(나) 학습자 개인별로 학습하는 속도가 다양할 수 있음을 고려하고, 최소 성취수준을 보장할 수 있도록 ＿＿＿＿(LMS)을 활용하여 온라인 학습자료를 제작 및 제공한다.",
        "answer": "학습관리시스템"
      },
      {
        "area": "",
        "question": "(다) 영역 간 교육과정 재구성을 통해 제시된 문제를 해결하는 문제기반학습과 학습자가 주제를 선정하고 탐구하는 ＿＿＿＿ 방법을 활용하여 학습자 중심의 활동 경험을 제공한다.",
        "answer": "프로젝트 기반학습"
      },
      {
        "area": "",
        "question": "(라) 디지털 교육 환경에 적응할 수 있도록 온오프라인 연계 수업, 다양한 디지털 도구의 활용 등을 통해 디지털 도구에 대한 ＿＿＿＿ 부담은 최소화하고, 활용에 대한 경험은 높일 수 있도록 수업을 구성한다.",
        "answer": "인지적"
      },
      {
        "area": "",
        "question": "(마) 프로그래밍에서 언어를 암기하여 습득하는 데 집중하기보다는 문제를 해결하는 ＿＿＿＿에 초점을 두며, 학습자가 흥미롭게 느낄 주제를 선정하여 과제로 제시한다.",
        "answer": "과정"
      }
    ],
    "evaluation": [
      {
        "area": "",
        "question": "(가) 평가 항목은 컴퓨팅 사고력, 디지털 문화 소양, ＿＿＿＿ 소양의 하위 요소를 기반으로 구체화한다.",
        "answer": "인공지능"
      },
      {
        "area": "",
        "question": "(나) 평가 내용은 지식 이해뿐 아니라, 과정 기능, ＿＿＿＿의 측면 등을 다면적으로 반영하고 과정을 중시하는 평가를 통해 학생의 성장과 발달을 돕는 평가를 실현한다.",
        "answer": "가치 태도"
      },
      {
        "area": "",
        "question": "(다) 구체적인 평가 ＿＿＿＿을 학생과 함께 구성하는 과정을 통해 학생이 자신의 학습 수준을 파악하고 스스로 학습을 성찰할 수 있는 기회를 제공한다.",
        "answer": "루브릭"
      },
      {
        "area": "",
        "question": "(라) 성취기준의 도달 수준을 파악하기 위한 평가뿐만 아니라 학습한 내용의 ＿＿＿＿를 통해 학습한 내용을 적용할 수 있는 과제를 제시하여 이해와 사고를 통합적으로 평가한다.",
        "answer": "전이"
      },
      {
        "area": "",
        "question": "(가) 성취기준을 분석하고 재구성하여 지필평가에 국한하지 않고, 학생의 성장에 기여할 수 있는 평가 ＿＿＿＿를 계획한다.",
        "answer": "포트폴리오"
      },
      {
        "area": "",
        "question": "(가) 관찰 평가, 서술형평가, 수행 평가 등을 활용하거나, 자기 평가, ＿＿＿＿ 등과 같은 다면적 평가를 실행한다.",
        "answer": "동료 평가"
      },
      {
        "area": "",
        "question": "(나) 평가 내용이나 방법에 따라 다양한 디지털 도구(프로그램 자동 평가시스템(＿＿＿＿ 등), 학습관리시스템(LMS) 등)를 활용할 수 있다.",
        "answer": "online judge"
      },
      {
        "area": "",
        "question": "(나) 평가 이전에 학생이 디지털 도구를 다룰 수 있도록 교육하여 평가의 ＿＿＿＿이 없도록 계획한다.",
        "answer": "불익"
      },
      {
        "area": "",
        "question": "(다) 실생활 및 다양한 학문 분야에서 해결할 수 있는 문제를 스스로 발견하도록 하고, 학생이 해결하는 수행 과정을 보고서나 포트폴리오 형태로 누적하여 평가가 ＿＿＿＿으로 이루어지도록 한다.",
        "answer": "지속적"
      },
      {
        "area": "",
        "question": "(라) 학습 부진, 느린 학습자가 참여할 수 있고, 학습자의 ＿＿＿＿을 보장할 수 있도록 난이도에 따른 평가기준을 세분화하여 제시한다.",
        "answer": "최소 성취수준"
      },
      {
        "area": "",
        "question": "(마) 문제 해결에 적합한 소프트웨어를 활용하여 데이터 수집, 가공, 분석 등 컴퓨팅 시스템을 통한 과정평가로 ＿＿＿＿을 함양하도록 한다.",
        "answer": "디지털 문해력"
      }
    ]
  },
  "ai-basic": {
    "goal": [
      {
        "area": "",
        "question": "'정보(Informatics)'과는 인공지능으로 정의되는 사회에서 데이터와 정보로 인한 디지털 세상의 변화를 인식하고, 정보의 사회적 가치를 탐구하며, 정보를 처리하는 다양한 원리와 기술에 기반한 ＿＿＿＿을 바탕으로 실생활 및 다양한 학문 분야의 문제를 해결하는 능력과 태도를 기르는 교과이다.",
        "answer": "컴퓨팅 사고력"
      },
      {
        "area": "",
        "question": "'정보'는 디지털 대전환 시대의 국가사회적 요구에 부응하여, 컴퓨팅을 활용한 문제 해결을 위해 사회 구성원이 갖추어야 할 ＿＿＿＿을 제공한다.",
        "answer": "필수 역량"
      },
      {
        "area": "",
        "question": "'정보'의 학문적 기저는 컴퓨터에서 처리되는 데이터와 정보의 원리, 컴퓨팅 시스템을 설계하고 구현하는 기술과 방법, 정보를 다루는 ＿＿＿＿에 대한 이해 등을 포괄하고 있다.",
        "answer": "인간 사회"
      },
      {
        "area": "",
        "question": "'정보'는 컴퓨터 과학뿐 아니라 데이터 과학, 인공지능, 정보기술, 정보시스템, 소프트웨어 공학 등의 분야를 포괄하는 ＿＿＿＿에 대한 기본 개념과 원리를 기반으로 다양한 학문 분야와 미래 사회의 문제를 해결하는 데 도움이 되는 지식과 기술을 함양한다.",
        "answer": "정보학"
      },
      {
        "area": "",
        "question": "교과의 이러한 특성은 사회 각 분야에서 요구되는 소프트웨어와 인공지능에 대한 기본 소양을 갖추고, 공학뿐만 아니라 자연과학, 인문·사회과학, 예술과 체육 등 다양한 학문 분야에서 문제를 창의적으로 해결하는 ＿＿＿＿ 양성에 도움을 준다.",
        "answer": "인재"
      },
      {
        "area": "",
        "question": "'인공지능 기초'는 학문의 분야 중 컴퓨터과학, 데이터 과학, ＿＿＿＿의 내용을 기반으로, 개인의 삶과 다양한 분야에서 직접적인 영향을 미치고 있는 인공지능에 대한 깊은 이해를 제공하게 된다.",
        "answer": "정보시스템"
      },
      {
        "area": "",
        "question": "미래 사회의 변화와 불확실성 등으로 인한 진로와 직업의 변화에 능동적으로 대처하며, 인공지능의 주체적 사용자인 학습자가 인공지능을 인간 중심으로 안전하고 책임 있게 사용하는 자기주도성을 갖춘 ＿＿＿＿으로 성장하게 한다.",
        "answer": "디지털 민주시민"
      },
      {
        "area": "",
        "question": "프로젝트 기반의 프로그래밍을 통한 직접 구현, 모델에 대한 평가 등 인공지능에 대한 깊이 있는 학습을 기반으로 ＿＿＿＿과 연계된 기초경험을 제공하도록 한다.",
        "answer": "대학의 전공"
      },
      {
        "area": "",
        "question": "'인공지능 기초'는 인공지능의 발전에 따른 사회의 변화를 파악하고, 인공지능의 원리에 대한 이해를 바탕으로 인공지능을 다양한 분야의 문제를 창의적으로 해결하기 위한 핵심 도구로서 ＿＿＿＿할 수 있으며, 인공지능의 윤리적 쟁점에 관한 올바른 가치관과 태도를 함양하는 데 중점을 둔다.",
        "answer": "프로그래밍"
      },
      {
        "area": "",
        "question": "인공지능에 대한 이해를 바탕으로 실생활의 문제를 인공지능의 관점에서 파악하고, 지능적 판단을 구현하기 위해 ＿＿＿＿ 방식을 적용하는 능력과 태도를 기른다.",
        "answer": "탐색과 추론"
      },
      {
        "area": "",
        "question": "＿＿＿＿을 활용하여 해결할 수 있는 문제를 정의하고, 문제 해결 과정에서 필요한 데이터와 모델을 활용하여 문제를 효과적으로 해결하는 능력과 태도를 기른다.",
        "answer": "기계학습"
      },
      {
        "area": "",
        "question": "인공지능의 발전에 따른 인간의 삶과 진로의 변화를 탐색하고, 인공지능의 다양한 측면에 대한 비판적인 자세를 바탕으로 인공지능과 관련된 ＿＿＿＿ 문제에 대해 올바른 가치관을 형성할 수 있는 태도를 기른다.",
        "answer": "윤리적"
      },
      {
        "area": "",
        "question": "인공지능이 다양한 분야와 융합하여 새로운 가치를 창출할 수 있다는 점을 인식하고, 인류가 직면해 있는 문제를 인공지능을 활용하여 해결할 수 있는 능력과 태도를 기른다.",
        "answer": "인류가 직면해 있는 문제"
      }
    ],
    "content": [
      {
        "area": "인공지능의 이해",
        "question": "인공지능은 인간의 지능적인 행동을 ＿＿＿＿하는 것으로 실생활에 도움을 준다.",
        "answer": "모방"
      },
      {
        "area": "인공지능의 이해",
        "question": "＿＿＿＿과 추론으로 문제를 해결하는 인공지능을 구현하는 것은 다양한 학문 분야에 활용된다.",
        "answer": "탐색"
      },
      {
        "area": "인공지능의 이해",
        "question": "이 영역의 지식 요소는 인공지능의 원리, 인공지능과 탐색, ＿＿＿＿의 표현과 추론이다.",
        "answer": "지식"
      },
      {
        "area": "인공지능의 이해",
        "question": "'인공지능의 이해' 영역의 과정 기능으로 인공지능 기반 문제 해결 사례 탐색하기, ＿＿＿＿ 알고리즘을 문제 해결에 적용하기, 추론을 통해 새로운 지식을 생성하는 방법 탐색하기가 있다.",
        "answer": "탐색"
      },
      {
        "area": "인공지능의 이해",
        "question": "'인공지능의 이해' 영역의 과정 기능으로 탐색 알고리즘을 문제 해결에 적용하기, 추론을 통해 새로운 ＿＿＿＿을 생성하는 방법 탐색하기가 있다.",
        "answer": "지식"
      },
      {
        "area": "인공지능의 이해",
        "question": "'인공지능의 이해' 영역의 가치·태도로 인공지능의 필요성과 적용 가능성 인식, 인공지능을 활용하여 실생활 및 다양한 학문 분야의 문제를 해결하는 자세가 있다.",
        "answer": "적용 가능성"
      },
      {
        "area": "인공지능과 학습",
        "question": "＿＿＿＿ 기반의 인공지능을 구현하기 위해서는 문제 해결에 적합한 데이터와 기계학습 모델을 활용한다.",
        "answer": "기계학습"
      },
      {
        "area": "인공지능과 학습",
        "question": "딥러닝은 다중의 ＿＿＿＿으로 구성된 인공신경망으로 복잡한 문제를 효과적으로 해결하는 데 활용된다.",
        "answer": "은닉층"
      },
      {
        "area": "인공지능과 학습",
        "question": "'인공지능과 학습' 영역의 지식 요소는 기계학습과 데이터, 기계학습 알고리즘, 인공신경망과 ＿＿＿＿이다.",
        "answer": "딥러닝"
      },
      {
        "area": "인공지능과 학습",
        "question": "'인공지능과 학습' 영역의 과정 기능으로 기계학습을 적용할 문제 정의하기, 해결하고자 하는 문제에 적합한 ＿＿＿＿ 탐색하기가 있다.",
        "answer": "데이터"
      },
      {
        "area": "인공지능과 학습",
        "question": "'인공지능과 학습' 영역의 과정 기능으로 문제에 적합한 기계학습 알고리즘을 선정하고, ＿＿＿＿ 구현하기가 있다.",
        "answer": "모델"
      },
      {
        "area": "인공지능과 학습",
        "question": "'인공지능과 학습' 영역의 과정 기능으로 딥러닝을 활용한 문제 해결 방법 탐색하고 구현하기가 있다.",
        "answer": "딥러닝"
      },
      {
        "area": "인공지능과 학습",
        "question": "'인공지능과 학습' 영역의 가치·태도로 기계학습에 적용하는 데이터의 중요성 판단, 학습을 통한 인공지능의 ＿＿＿＿과 효율성 인식이 있다.",
        "answer": "효과성"
      },
      {
        "area": "인공지능의 사회적 영향",
        "question": "인공지능이 현대 사회에 끼치는 영향력이 커지고 있고, 이에 따라 ＿＿＿＿의 변화 속도가 빨라지고 있다.",
        "answer": "직업"
      },
      {
        "area": "인공지능의 사회적 영향",
        "question": "인공지능을 올바르게 활용하기 위해서는 인공지능에 의해 발생할 수 있는 ＿＿＿＿ 문제에 대한 이해가 필요하다.",
        "answer": "윤리적"
      },
      {
        "area": "인공지능의 사회적 영향",
        "question": "'인공지능의 사회적 영향' 영역의 지식 요소는 인공지능의 발전과 사회 변화, 인공지능과 진로, 인공지능과 ＿＿＿＿이다.",
        "answer": "윤리"
      },
      {
        "area": "인공지능의 사회적 영향",
        "question": "'인공지능의 사회적 영향' 영역의 과정 기능으로 인공지능으로 해결할 수 있는 사회적 문제 탐색하기, 인공지능에 의해 변화하는 인간의 삶과 ＿＿＿＿의 양상 파악하기가 있다.",
        "answer": "직업"
      },
      {
        "area": "인공지능의 사회적 영향",
        "question": "'인공지능의 사회적 영향' 영역의 과정 기능으로 인공지능과 인간의 ＿＿＿＿ 방안에 대해 탐색하기가 있다.",
        "answer": "공존"
      },
      {
        "area": "인공지능의 사회적 영향",
        "question": "'인공지능의 사회적 영향' 영역의 과정 기능으로 인공지능과 관련된 윤리적 ＿＿＿＿ 상황에 대해 논의하기가 있다.",
        "answer": "딜레마"
      },
      {
        "area": "인공지능의 사회적 영향",
        "question": "'인공지능의 사회적 영향' 영역의 가치·태도로 진로 및 직업 관점에서 인공지능의 중요성 인식, 인공지능의 다양한 측면에 대한 비판적 자세와 ＿＿＿＿ 태도가 있다.",
        "answer": "윤리적"
      },
      {
        "area": "인공지능 프로젝트",
        "question": "인공지능은 다양한 분야와 융합하여 새로운 가치를 창출하는 데 도움을 준다.",
        "answer": "새로운 가치"
      },
      {
        "area": "인공지능 프로젝트",
        "question": "인공지능은 ＿＿＿＿을 달성하는 데 도움을 준다.",
        "answer": "지속가능발전목표"
      },
      {
        "area": "인공지능 프로젝트",
        "question": "'인공지능 프로젝트' 영역의 지식 요소는 인공지능과 지속가능발전목표, 인공지능 ＿＿＿＿ 절차이다.",
        "answer": "문제 해결"
      },
      {
        "area": "인공지능 프로젝트",
        "question": "'인공지능 프로젝트' 영역의 과정 기능으로 인공지능 프로젝트 주제 탐색하기, 인공지능 프로젝트 수행 계획 구안하기, 인공지능 소프트웨어 개발 및 ＿＿＿＿ 방법 설정하기가 있다.",
        "answer": "평가"
      },
      {
        "area": "인공지능 프로젝트",
        "question": "'인공지능 프로젝트' 영역의 가치·태도로 인류의 지속가능발전에서 인공지능의 중요성 및 가치를 판단하는 태도가 있다.",
        "answer": "인류의 지속가능발전"
      },
      {
        "area": "인공지능 프로젝트",
        "question": "'인공지능 프로젝트' 영역의 가치·태도로 인공지능 프로젝트를 수행하는 과정에서 ＿＿＿＿으로 문제를 해결하는 자세가 있다.",
        "answer": "협력적"
      },
      {
        "area": "인공지능 프로젝트",
        "question": "'인공지능 프로젝트' 영역의 가치·태도로 프로젝트를 수행하는 과정에서 윤리 문제 등 ＿＿＿＿ 인식이 있다.",
        "answer": "사회적 영향"
      }
    ],
    "standard": [
      {
        "area": "인공지능의 이해",
        "question": "인공지능의 지능적 판단에 대한 이해를 바탕으로 인공지능을 활용한 실생활 및 다양한 학문 분야의 ＿＿＿＿ 사례를 비교·분석한다. [12인기01-01]",
        "answer": "문제 해결"
      },
      {
        "area": "인공지능의 이해",
        "question": "인공지능에서 ＿＿＿＿의 중요성을 이해하고 문제 해결을 위한 탐색 과정을 설계한다. [12인기01-02]",
        "answer": "탐색"
      },
      {
        "area": "인공지능의 이해",
        "question": "맹목적 탐색과 정보 이용 탐색의 차이를 중심으로 ＿＿＿＿의 원리를 파악한다. [12인기01-03]",
        "answer": "지능적 탐색"
      },
      {
        "area": "인공지능의 이해",
        "question": "지능적 탐색이 필요한 문제를 찾아보고 문제 해결을 위해 ＿＿＿＿ 알고리즘을 적용한다. [12인기01-04]",
        "answer": "정보 이용 탐색"
      },
      {
        "area": "인공지능의 이해",
        "question": "규칙과 사실을 활용하여 지식을 표현하고, 새로운 지식을 ＿＿＿＿하여 생성한다. [12인기01-05]",
        "answer": "추론"
      },
      {
        "area": "인공지능의 이해",
        "question": "인공지능의 개념과 특성을 이해하고, ＿＿＿＿를 통해 인공지능의 지능적 판단에 대해 고찰하며, 인공지능이 활용된 최신 사례를 분석하여 인공지능의 활용 범위와 중요성을 설명할 수 있어야 한다.",
        "answer": "튜링 테스트"
      },
      {
        "area": "인공지능의 이해",
        "question": "지능적 탐색을 적용할 수 있는 퍼즐이나 길찾기 문제를 탐색하고, 최상 우선, ＿＿＿＿ 등의 정보 이용 탐색 방법을 적용한 인공지능 프로그램을 개발할 수 있어야 한다.",
        "answer": "A*"
      },
      {
        "area": "인공지능의 이해",
        "question": "인공지능의 다양한 사례를 탐색하여 실제로 많은 분야에 인공지능이 활용되고 있음을 인식하고, 인공지능을 구현하는 방법으로서 ＿＿＿＿ 방식에 대한 이해를 바탕으로 문제를 해결할 수 있는 능력을 함양하도록 교수·학습을 계획한다.",
        "answer": "탐색과 추론"
      },
      {
        "area": "인공지능의 이해",
        "question": "탐색 방식으로 문제를 해결하는 과정에서는 탐색 알고리즘을 적용한 ＿＿＿＿을 개발하는 방식으로 활동을 구성하도록 한다.",
        "answer": "프로그램"
      },
      {
        "area": "인공지능의 이해",
        "question": "실제 사례를 통해 인공지능의 개념을 정확하게 이해하고 있는지, 인공지능의 ＿＿＿＿을 설명할 수 있는지를 평가한다.",
        "answer": "중요성"
      },
      {
        "area": "인공지능의 이해",
        "question": "문제 해결에 적합한 탐색 알고리즘을 선택하여 적용하였는지, 개발한 인공지능 프로그램이 문제를 해결하는 데 효과적이었는지에 중점을 두어 평가하도록 한다.",
        "answer": "효과적"
      },
      {
        "area": "인공지능과 학습",
        "question": "기계학습을 적용할 문제를 정의하고, 문제 해결에 필요한 ＿＿＿＿를 선정하여 수집한다. [12인기02-01]",
        "answer": "데이터"
      },
      {
        "area": "인공지능과 학습",
        "question": "수집한 데이터를 가공하여 핵심 ＿＿＿＿을 추출한다. [12인기02-02]",
        "answer": "속성"
      },
      {
        "area": "인공지능과 학습",
        "question": "문제 해결에 적합한 기계학습의 유형과 ＿＿＿＿을 선정한다. [12인기02-03]",
        "answer": "알고리즘"
      },
      {
        "area": "인공지능과 학습",
        "question": "훈련 데이터를 이용하여 학습을 진행하고, ＿＿＿＿ 데이터를 사용하여 성능을 평가한다. [12인기02-04]",
        "answer": "테스트"
      },
      {
        "area": "인공지능과 학습",
        "question": "인공신경망과 딥러닝의 특성에 대한 이해를 바탕으로 ＿＿＿＿ 분야를 탐색한다. [12인기02-05]",
        "answer": "활용"
      },
      {
        "area": "인공지능과 학습",
        "question": "딥러닝을 활용하여 실생활 및 다양한 학문 분야의 문제를 해결하고, ＿＿＿＿을 평가한다. [12인기02-06]",
        "answer": "성능"
      },
      {
        "area": "인공지능과 학습",
        "question": "전통적 프로그래밍과 대비되는 ＿＿＿＿의 특성을 이해하여 기계학습 기반의 인공지능을 적용할 문제를 판단하고, 문제 해결에 적합한 데이터를 수집할 수 있어야 한다.",
        "answer": "기계학습"
      },
      {
        "area": "인공지능과 학습",
        "question": "데이터 수집 과정에서 나타날 수 있는 데이터의 ＿＿＿＿이 인공지능의 학습에 영향을 미칠 수 있음을 고려하여 데이터의 수집과 활용에 공정성을 추구할 수 있어야 한다.",
        "answer": "편향"
      },
      {
        "area": "인공지능과 학습",
        "question": "기계학습에 사용할 데이터를 수집한 후, ＿＿＿＿와 이상치의 유무를 파악하고 문제 해결에 필요한 속성이 무엇인지 선별한 다음 문제 해결에 적합한 형태로 전처리할 수 있어야 한다.",
        "answer": "결측치"
      },
      {
        "area": "인공지능과 학습",
        "question": "기계학습의 유형을 지도학습과 ＿＿＿＿, 강화학습 등으로 구분하고, 해결해야 하는 문제의 특성을 고려하여 문제 해결에 적합한 유형을 선정할 수 있어야 한다.",
        "answer": "비지도학습"
      },
      {
        "area": "인공지능과 학습",
        "question": "분류, 예측, ＿＿＿＿ 등에 활용하는 기계학습 알고리즘을 이해하여 문제 해결에 적합한 알고리즘을 선정할 수 있어야 한다.",
        "answer": "군집"
      },
      {
        "area": "인공지능과 학습",
        "question": "딥러닝을 기반으로 하는 컴퓨터 비전, 음성 인식, ＿＿＿＿ 기술을 구현하는 방식을 이용하고, 적합한 딥러닝 기술을 활용하여 실생활 및 다양한 학문 분야의 문제를 해결할 수 있어야 한다.",
        "answer": "자연어처리"
      },
      {
        "area": "인공지능과 학습",
        "question": "문제 해결에 있어 딥러닝을 활용해 문제를 해결하는 경우와 다른 방법으로 문제를 해결한 경우의 ＿＿＿＿을 설명할 수 있어야 한다.",
        "answer": "차이점"
      },
      {
        "area": "인공지능과 학습",
        "question": "해결하고자 하는 문제에 따라 기계학습의 사용이 적합한지를 판단할 수 있도록 적절한 문제 상황을 선정하도록 하며, 기계학습에서 데이터의 중요성을 인식하고, 데이터를 수집하는 과정에서 데이터가 ＿＿＿＿되지 않게 충분히 안내하도록 한다.",
        "answer": "편향"
      },
      {
        "area": "인공지능과 학습",
        "question": "기계학습과 딥러닝을 구현하는 과정에서 학습자의 수준에 따라 ＿＿＿＿ 작성의 방식을 달리 구성할 수 있다.",
        "answer": "코드"
      },
      {
        "area": "인공지능과 학습",
        "question": "프로그래밍 역량이 낮은 학생은 이미 작성된 코드를 실행시켜 코드를 이해한 후 차츰 코드 일부를 수정하는 방식으로 학습할 수 있도록 하고, 프로그래밍 역량이 높은 학생은 작성이 완료되지 않은 코드를 스스로 완성하여 실행시킬 수 있도록 하는 등 교수·학습 단계를 세부적으로 구성하여 학습자의 ＿＿＿＿가 유지되도록 한다.",
        "answer": "흥미"
      },
      {
        "area": "인공지능과 학습",
        "question": "기계학습과 딥러닝을 코드로 구현하는 학습을 원활하게 진행하기 위해, 다양한 ＿＿＿＿ 활용 방법을 충분히 안내한다.",
        "answer": "라이브러리"
      },
      {
        "area": "인공지능과 학습",
        "question": "문제 해결에 사용된 데이터와 기계학습 유형, 기계학습 알고리즘이 해결하고자 하는 문제의 특성에 비추어 적합한지를 평가한다.",
        "answer": "기계학습 유형"
      },
      {
        "area": "인공지능과 학습",
        "question": "이미 개발되어 있는 딥러닝 프로그램 코드의 활용을 권장하되 실생활 및 다양한 학문 분야의 문제를 스스로 생각하여 해결할 수 있도록 교수·학습을 구성하고, 학생의 학습 과정과 창의적인 아이디어를 중심으로 평가 ＿＿＿＿을 작성하여 평가하도록 한다.",
        "answer": "루브릭"
      },
      {
        "area": "인공지능의 사회적 영향",
        "question": "인공지능의 발전으로 인한 사회 변화를 살펴보고, 인공지능으로 해결할 수 있는 ＿＿＿＿ 문제를 분석한다. [12인기03-01]",
        "answer": "사회적"
      },
      {
        "area": "인공지능의 사회적 영향",
        "question": "인공지능에 의해 변화하는 인간의 삶과 직업의 양상에 대해 이해하고 ＿＿＿＿를 탐색한다. [12인기03-02]",
        "answer": "진로"
      },
      {
        "area": "인공지능의 사회적 영향",
        "question": "인공지능에 대한 비판적 자세를 바탕으로 인공지능과 인간의 ＿＿＿＿ 방안을 도출한다. [12인기03-03]",
        "answer": "공존"
      },
      {
        "area": "인공지능의 사회적 영향",
        "question": "인공지능의 활용사례와 윤리적 딜레마 상황을 인공지능 ＿＿＿＿ 관점에서 분석한다. [12인기03-04]",
        "answer": "윤리"
      },
      {
        "area": "인공지능의 사회적 영향",
        "question": "인공지능에 대한 일방적인 수용 또는 거부보다는, 비판적인 자세를 바탕으로 인간과 공존해야 하는 존재로서 인공지능의 역할을 제시할 수 있어야 한다.",
        "answer": "비판적인 자세"
      },
      {
        "area": "인공지능의 사회적 영향",
        "question": "인공지능을 대하는 인간의 태도에 대한 윤리적 고찰을 통해 바람직한 ＿＿＿＿ 방식을 규정할 수 있어야 한다.",
        "answer": "공존"
      },
      {
        "area": "인공지능의 사회적 영향",
        "question": "인간의 편향성에 대한 이해를 바탕으로, 알고리즘과 데이터의 편향성으로 인해 인공지능이 사회에 끼치는 영향을 이해하고 인공지능으로 인한 ＿＿＿＿ 상황에서 윤리적인 판단과 선택을 할 수 있어야 한다.",
        "answer": "딜레마"
      },
      {
        "area": "인공지능의 사회적 영향",
        "question": "현재까지 정의되어진 인공지능 윤리(지침)와 관련하여 인공지능 개발자, 사용자, ＿＿＿＿ 관점을 살펴보고, 인공지능 기술 활용으로 발생 가능한 윤리적 쟁점에 대하여 사회적 책임과 공정성의 가치를 판단할 수 있어야 한다.",
        "answer": "운영·관리자"
      },
      {
        "area": "인공지능의 사회적 영향",
        "question": "인공지능의 사회적 가치와 영향력이 중요하다는 것과 새롭게 고려해야 할 윤리적 쟁점에 대한 충분한 사회적 논의 과정이 필요하다는 것을 전제로, 인공지능 사회의 구성원으로서 갖추어야 할 인공지능 ＿＿＿＿과 가치 판단 능력을 함양한다.",
        "answer": "윤리의식"
      },
      {
        "area": "인공지능의 사회적 영향",
        "question": "인공지능의 발전으로 인한 사회의 변화를 조사하고 인공지능에 의해 변화할 미래 사회의 모습을 예측하는 과정에서 자신의 ＿＿＿＿를 구체적으로 설계하기 위해 충분한 자료를 제공하도록 한다.",
        "answer": "진로"
      },
      {
        "area": "인공지능의 사회적 영향",
        "question": "인공지능과 관련한 윤리적 쟁점 사례를 조사하고, 구체적인 사안을 주제로 하는 ＿＿＿＿ 활동의 과정에서 인공지능 윤리의 중요성과 인공지능과 인간의 관계를 올바르게 설명할 수 있는지를 평가하도록 한다.",
        "answer": "토론"
      },
      {
        "area": "인공지능의 사회적 영향",
        "question": "토론 과정에서 근거를 바탕으로 자신의 주장을 펼치고 타인의 견해를 존중하는 성숙한 ＿＿＿＿ 문화를 조성하도록 한다.",
        "answer": "토론"
      },
      {
        "area": "인공지능 프로젝트",
        "question": "지속가능발전목표를 해결하기 위해 인공지능을 적용할 수 있는 방안을 탐색하고, 인공지능 프로젝트 활동에 적합한 주제를 도출한다. [12인기04-01]",
        "answer": "지속가능발전목표"
      },
      {
        "area": "인공지능 프로젝트",
        "question": "인공지능 문제 해결 과정에 기반하여 프로젝트 ＿＿＿＿ 계획을 구안한다. [12인기04-02]",
        "answer": "수행"
      },
      {
        "area": "인공지능 프로젝트",
        "question": "인공지능 프로젝트를 수행하는 과정에서 ＿＿＿＿ 자세를 바탕으로 인공지능 소프트웨어를 개발한다. [12인기04-03]",
        "answer": "협력적인 문제 해결"
      },
      {
        "area": "인공지능 프로젝트",
        "question": "인공지능의 사회적 영향을 고려하여 인공지능 소프트웨어를 개발하고, 평가 결과를 반영하여 ＿＿＿＿을 개선한다. [12인기04-04]",
        "answer": "성능"
      },
      {
        "area": "인공지능 프로젝트",
        "question": "지속가능발전목표는 ＿＿＿＿년 유엔 총회에서 결의한 것으로 총 17개의 주요 목표와 169개의 세부 목표로 구성되어 있다.",
        "answer": "2015"
      },
      {
        "area": "인공지능 프로젝트",
        "question": "지속가능발전목표는 2015년 유엔 총회에서 결의한 것으로 총 ＿＿＿＿개의 주요 목표와 169개의 세부 목표로 구성되어 있다는 것을 이해한다.",
        "answer": "17"
      },
      {
        "area": "인공지능 프로젝트",
        "question": "17개의 주요 목표를 통해 현재 인류가 직면하고 있는 위기가 무엇인지 인식하고, 인공지능을 활용하여 달성할 수 있는 목표에는 어떤 것이 있는지를 살펴보고 인공지능 프로젝트 활동에 적합한 ＿＿＿＿를 도출할 수 있어야 한다.",
        "answer": "주제"
      },
      {
        "area": "인공지능 프로젝트",
        "question": "문제 정의, 문제 해결에 적합한 데이터 수집 및 전처리, 기계학습 유형과 알고리즘 선정, 기계학습을 통한 모델 생성, ＿＿＿＿ 및 수정 등의 인공지능 문제 해결 과정에 따라 프로젝트 수행 계획을 구안할 수 있어야 한다.",
        "answer": "성능 평가"
      },
      {
        "area": "인공지능 프로젝트",
        "question": "인공지능 프로젝트를 위한 주제 선정 과정에서 인류가 직면해 있는 다양한 위기를 충분히 인식할 수 있도록 하고, 이러한 위기를 극복하는 다양한 방법 중 하나로 ＿＿＿＿이 중요한 역할을 수행할 수 있다는 점을 강조하도록 한다.",
        "answer": "인공지능"
      },
      {
        "area": "인공지능 프로젝트",
        "question": "인공지능을 활용하는 방법적인 측면에서 직접 구현하기가 어려운 부분이 있더라도 학습자의 ＿＿＿＿를 존중하여 다양한 생각이 발산될 수 있는 활동을 구성하도록 한다.",
        "answer": "아이디어"
      },
      {
        "area": "인공지능 프로젝트",
        "question": "인공지능 프로젝트를 수행하는 과정에서 인공지능 소프트웨어의 완성도뿐만 아니라 주제의 적절성, 문제 해결 방식의 ＿＿＿＿, 다른 사람과의 협업 능력 등 다각적인 측면을 골고루 반영하여 평가할 수 있는 루브릭을 제작하도록 한다.",
        "answer": "창의성"
      }
    ],
    "teach": [
      {
        "area": "",
        "question": "실제적인 삶의 맥락에서 컴퓨팅을 통해 문제를 해결하도록 하는 학습 과제를 제시하여 학습자가 과제를 스스로 해결하는 과정에서 자연스럽게 컴퓨팅 사고력, 디지털 문화 소양, ＿＿＿＿을 함양할 수 있도록 지도한다.",
        "answer": "인공지능 소양"
      },
      {
        "area": "",
        "question": "학습자의 흥미와 다양성을 고려하여 학습 소재, 학습 환경 및 학습 과정에 대한 선택의 기회를 제공하고, 교수·학습의 설계 과정에 학습자 참여 기회를 증진하는 등 ＿＿＿＿ 교수·학습을 통해 역량 함양을 위한 깊이 있는 학습 지도 방안을 구성한다.",
        "answer": "학습자 맞춤형"
      },
      {
        "area": "",
        "question": "인공지능 기초 과목의 지식 이해, 과정 기능을 활용하여 민주시민교육, 생태전환 교육 등 현 시대가 당면한 여러 사회문제와 더불어 ＿＿＿＿ 등의 범교과 주제를 교수·학습 과제로 제시하여 주도성 있는 문제 해결 경험을 제공한다.",
        "answer": "지속가능발전"
      },
      {
        "area": "",
        "question": "'인공지능 기초' 과목의 교수·학습은 인공지능의 원리에 대한 이해를 바탕으로 문제를 효율적으로 해결하는 역량을 향상하는 데 중점을 둔다.",
        "answer": "인공지능의 원리"
      },
      {
        "area": "",
        "question": "'인공지능 기초' 과목 내의 내용 영역, 다른 교과 및 비교과 활동과의 ＿＿＿＿을 통해 학생의 인공지능 소양이 다양한 분야에 전이될 수 있도록 한다.",
        "answer": "융합"
      },
      {
        "area": "",
        "question": "교과 역량을 함양하기 위해 문제기반학습, 프로젝트 기반학습, 디자인기반학습, ＿＿＿＿, 탐구학습 등 각 영역의 핵심 아이디어를 습득하는 데 적절한 교수·학습 방법을 선택하여 활용한다.",
        "answer": "짝 프로그래밍"
      },
      {
        "area": "",
        "question": "학습자 개인별로 학습하는 속도가 다양할 수 있음을 고려하고, 최소 성취수준을 보장할 수 있도록 ＿＿＿＿(LMS)을 활용하여 온라인 학습자료를 제작 및 제공함으로써 학습 격차를 최소화하도록 노력한다.",
        "answer": "학습관리시스템"
      },
      {
        "area": "",
        "question": "학습자의 디지털 인공지능 소양에 대해 선제적으로 파악하고 학생의 현재 수준에 맞는 방식으로 교수·학습 활동을 구성한다. ＿＿＿＿을 통한 인공지능 프로그램의 개발 활동을 중심으로 하되, 인공지능 개념 이해에 도움이 되는 소프트웨어나 인공지능 관련 라이브러리를 적극적으로 활용하여 최소 성취수준을 보장하도록 한다.",
        "answer": "프로그래밍"
      },
      {
        "area": "",
        "question": "디지털 교육 환경에 적응할 수 있도록 온오프라인 연계 수업, 다양한 디지털 도구의 활용 등을 통해 디지털 도구에 대한 ＿＿＿＿ 부담은 최소화하고, 활용에 대한 경험은 높일 수 있도록 수업을 구성한다.",
        "answer": "인지적"
      },
      {
        "area": "",
        "question": "'인공지능 기초' 과목과 연계된 ＿＿＿＿ 및 직업을 안내하고 학생이 자신의 진로를 탐색할 수 있도록 교수·학습 과정을 구성한다.",
        "answer": "진로"
      }
    ],
    "evaluation": [
      {
        "area": "",
        "question": "평가 항목은 컴퓨팅 사고력, 디지털 문화 소양, ＿＿＿＿의 하위 요소를 기반으로 구체화한다.",
        "answer": "인공지능 소양"
      },
      {
        "area": "",
        "question": "평가 내용은 지식 이해뿐 아니라, 과정 기능, ＿＿＿＿의 측면 등을 다면적으로 반영하고 과정을 중시하는 평가를 통해 학생의 성장과 발달을 돕는 평가를 실현한다.",
        "answer": "가치 태도"
      },
      {
        "area": "",
        "question": "구체적인 평가 루브릭을 학생과 함께 구성하는 과정을 통해 학생이 자신의 학습 수준을 파악하고 스스로 학습을 성찰할 수 있는 기회를 제공하여, 적극적이고 능동적인 학습이 이루어지도록 한다.",
        "answer": "평가 루브릭"
      },
      {
        "area": "",
        "question": "인공지능 프로그램 구현에 프로그래밍 활동이 포함되나 프로그래밍 내용보다는 인공지능의 구현과 활용, 인공지능 활용에 대한 ＿＿＿＿에 초점을 맞추어 평가한다.",
        "answer": "인식"
      },
      {
        "area": "",
        "question": "성취기준을 분석하고 재구성하여 지필평가 및 수행평가, 관찰 평가, ＿＿＿＿ 평가 등을 활용하는 종합적인 평가 포트폴리오를 계획한다.",
        "answer": "서·논술형"
      },
      {
        "area": "",
        "question": "교사 평가, 자기 평가, ＿＿＿＿ 등과 같은 다면적 평가를 실행하여 학생 성장에 기여할 수 있는 결과를 제공한다.",
        "answer": "동료 평가"
      },
      {
        "area": "",
        "question": "평가 내용이나 방법에 따라 다양한 디지털 도구(프로그램 자동 평가시스템(＿＿＿＿ 등), 학습관리시스템(LMS) 등)를 활용할 수 있다.",
        "answer": "online judge"
      },
      {
        "area": "",
        "question": "평가 이전에 학생이 디지털 도구를 다룰 수 있도록 교육하여 평가의 ＿＿＿＿가 없도록 계획한다.",
        "answer": "불이익"
      },
      {
        "area": "",
        "question": "인공지능에 관련된 평가는 다양한 방식으로 나타날 수 있으므로 ＿＿＿＿ 평가와 정성적 평가 내용을 명확하게 구분한다.",
        "answer": "정량적"
      },
      {
        "area": "",
        "question": "모델 학습과 적용이 반복적으로 이루어지는 ＿＿＿＿의 경우 평가 결과가 학생 활동에 즉시 피드백되어 결과물의 개선으로 나타날 수 있도록 평가를 계획한다.",
        "answer": "프로젝트"
      }
    ]
  },
  "data-science": {
    "goal": [
      {
        "area": "",
        "question": "'정보'과는 인공지능으로 정의되는 사회에서 데이터와 정보로 인한 디지털 세상의 변화를 인식하고, 정보의 사회적 가치를 탐구하며, 정보를 처리하는 다양한 원리와 기술에 기반한 ＿＿＿＿을 바탕으로 실생활 및 다양한 학문 분야의 문제를 해결하는 능력과 태도를 기르는 교과이다.",
        "answer": "컴퓨팅 사고력"
      },
      {
        "area": "",
        "question": "'정보'는 디지털 대전환 시대의 국가·사회적 요구에 부응하여, 컴퓨팅을 활용한 문제 해결을 위해 사회 구성원이 갖추어야 할 필수 ＿＿＿＿을 제공한다.",
        "answer": "역량"
      },
      {
        "area": "",
        "question": "'정보(Informatics)'의 학문적 기저는 컴퓨터에서 처리되는 데이터와 정보의 원리, 컴퓨팅 시스템을 설계하고 구현하는 기술과 방법, 정보를 다루는 ＿＿＿＿에 대한 이해 등을 포괄하고 있다.",
        "answer": "인간 사회"
      },
      {
        "area": "",
        "question": "'정보'는 컴퓨터과학뿐 아니라 데이터 과학, 인공지능, 정보기술, 정보시스템, 소프트웨어 공학 등의 분야를 포괄하는 ＿＿＿＿에 대한 기본 개념과 원리를 기반으로 다양한 학문 분야와 미래 사회의 문제를 해결하는 데 도움이 되는 지식과 기술을 함양한다.",
        "answer": "정보학"
      },
      {
        "area": "",
        "question": "교과의 이러한 특성은 사회 각 분야에서 요구되는 소프트웨어와 인공지능에 대한 기본 소양을 갖추고, 공학뿐만 아니라 자연과학, 인문·사회과학, 예술과 체육 등 다양한 학문 분야에서 문제를 창의적으로 해결하는 ＿＿＿＿ 양성에 도움을 준다.",
        "answer": "인재"
      },
      {
        "area": "",
        "question": "'데이터 과학'은 데이터와 데이터 처리에 대한 다양한 방법론을 기반으로 통계와 ＿＿＿＿ 등을 활용하여 다양한 학문 분야의 문제 해결과 의사 결정에서 통찰력을 제공하게 된다.",
        "answer": "기계학습"
      },
      {
        "area": "",
        "question": "데이터 과학은 개인의 삶과 연관되어 일상과 향후의 직업에서 ＿＿＿＿의 발전에 능동적으로 대처할 수 있도록 한다.",
        "answer": "기술"
      },
      {
        "area": "",
        "question": "학생들은 데이터 과학의 기초적인 원리를 이해하고 ＿＿＿＿을 함양함으로써 급증하는 데이터를 비판적으로 분석할 수 있다.",
        "answer": "데이터 문해력"
      },
      {
        "area": "",
        "question": "학생들은 데이터 문해력을 함양함으로써 급증하는 데이터를 비판적으로 분석할 수 있으며, 미래 사회와 환경변화 등에 대한 통찰력과 책임감 있는 자기주도성을 갖춘 ＿＿＿＿으로 성장하게 된다.",
        "answer": "디지털 민주시민"
      },
      {
        "area": "",
        "question": "'데이터 과학'은 컴퓨팅 사고력을 바탕으로 실생활 및 다양한 분야의 문제를 창의적으로 해결하는 데 필요한 능력과 태도를 함양하며, 데이터 과학의 지식이 필요한 ＿＿＿＿과 연계된 기초경험을 제공하도록 한다.",
        "answer": "진로"
      },
      {
        "area": "",
        "question": "'데이터 과학'은 컴퓨팅 사고력을 기반으로 디지털 사회에서 데이터의 역할 및 잠재적 가치와 데이터 과학에 기반한 ＿＿＿＿의 중요성을 인식하며, 다양한 분야의 문제를 해결하고 합리적 의사 결정을 위한 통찰의 역량을 키우는 데 중점을 둔다.",
        "answer": "문제 해결 과정"
      },
      {
        "area": "",
        "question": "데이터 과학의 발전에 따른 사회의 특성과 데이터의 가치를 이해하고, 데이터에 기반한 ＿＿＿＿을 실천하는 태도를 기른다.",
        "answer": "합리적인 의사 결정"
      },
      {
        "area": "",
        "question": "데이터 분석과 관련된 효과적인 방법을 이해하고, 문제상황에 따라 데이터의 ＿＿＿＿를 파악하여 다양한 분석 방법을 적용할 수 있는 능력을 기른다.",
        "answer": "관계"
      },
      {
        "area": "",
        "question": "문제를 합리적으로 해결하기 위한 모델을 구성하고, 문제 해결 과정에서 발생할 수 있는 여러 쟁점을 비교하며, 분석된 결과의 의미를 찾아 ＿＿＿＿하는 능력과 태도를 기른다.",
        "answer": "비판적으로 해석"
      },
      {
        "area": "",
        "question": "데이터 과학을 기반으로 한 문제 해결이 합리적 의사 결정에 효과적임을 인식하고, 데이터 과학의 방법으로 문제를 해결하는 능력과 태도를 기른다는 것은 데이터 과학 과목의 ＿＿＿＿ 번째 목표이다.",
        "answer": "네"
      }
    ],
    "content": [
      {
        "area": "데이터 과학의 이해",
        "question": "디지털 사회의 시민에게는 데이터에 기반한 ＿＿＿＿ 의사 결정이 필요하다.",
        "answer": "합리적인"
      },
      {
        "area": "데이터 과학의 이해",
        "question": "데이터 과학에 대한 이해는 데이터를 활용하여 ＿＿＿＿ 문제를 해결하는 데 도움을 준다.",
        "answer": "복잡한"
      },
      {
        "area": "데이터 과학의 이해",
        "question": "'데이터 과학의 이해' 영역의 지식·이해 요소는 데이터 과학의 개념, 데이터의 형태와 속성, ＿＿＿＿과 데이터베이스이다.",
        "answer": "데이터셋"
      },
      {
        "area": "데이터 과학의 이해",
        "question": "'데이터 과학의 이해' 영역의 과정·기능 요소는 데이터 과학의 문제 해결 사례 탐색하기, 데이터의 형태와 속성 파악하기, ＿＿＿＿의 의미 파악하기이다.",
        "answer": "데이터 통합"
      },
      {
        "area": "데이터 과학의 이해",
        "question": "'데이터 과학의 이해' 영역의 가치·태도 요소로 데이터 기반 의사 결정의 중요성 인식과 데이터의 ＿＿＿＿ 내면화가 제시된다.",
        "answer": "잠재적 가치"
      },
      {
        "area": "데이터 과학의 이해",
        "question": "'데이터 과학의 이해' 영역의 가치·태도 요소로 데이터 과학을 통한 ＿＿＿＿ 참여가 제시된다.",
        "answer": "진로설계"
      },
      {
        "area": "데이터 준비와 분석",
        "question": "데이터 분석을 위해서는 데이터를 수집, ＿＿＿＿하는 과정이 필요하다.",
        "answer": "전처리"
      },
      {
        "area": "데이터 준비와 분석",
        "question": "데이터 처리는 데이터를 분석에 효과적인 형태로 변환하며, ＿＿＿＿을 추출하는 데 도움을 준다.",
        "answer": "지식"
      },
      {
        "area": "데이터 준비와 분석",
        "question": "'데이터 준비와 분석' 영역의 지식·이해 요소는 데이터 전처리, ＿＿＿＿ 방법이다.",
        "answer": "데이터 분석"
      },
      {
        "area": "데이터 준비와 분석",
        "question": "'데이터 준비와 분석' 영역의 과정·기능 요소 중 하나로 이상치와 ＿＿＿＿ 처리하고 정규화 활용하기가 있다.",
        "answer": "결측치"
      },
      {
        "area": "데이터 준비와 분석",
        "question": "'데이터 준비와 분석' 영역의 과정·기능 요소 중 하나로 데이터 속성 간의 관계를 파악하고 통합하여 ＿＿＿＿하기가 있다.",
        "answer": "탐색"
      },
      {
        "area": "데이터 준비와 분석",
        "question": "'데이터 준비와 분석' 영역의 과정·기능 요소 중 하나로 서로 다른 데이터 분석 방법 ＿＿＿＿하기가 있다.",
        "answer": "비교"
      },
      {
        "area": "데이터 준비와 분석",
        "question": "'데이터 준비와 분석' 영역의 가치·태도 요소로 데이터가 편향되지 않도록 수집하는 자세와 데이터의 불확실성과 ＿＿＿＿ 인식이 제시된다.",
        "answer": "오류 가능성"
      },
      {
        "area": "데이터 모델링과 평가",
        "question": "＿＿＿＿은 문제를 합리적으로 해결할 수 있도록 도움을 준다.",
        "answer": "데이터 모델"
      },
      {
        "area": "데이터 모델링과 평가",
        "question": "데이터 기반의 합리적 의사 결정을 위해 데이터를 분석해서 새로운 지식을 추출하고, ＿＿＿＿를 해석한다.",
        "answer": "의미"
      },
      {
        "area": "데이터 모델링과 평가",
        "question": "'데이터 모델링과 평가' 영역의 지식·이해 요소에는 데이터 모델의 개념, ＿＿＿＿, 군집 분석, 연관 분석이 포함된다.",
        "answer": "회귀 분석"
      },
      {
        "area": "데이터 모델링과 평가",
        "question": "'데이터 모델링과 평가' 영역의 지식·이해 요소에는 데이터 모델의 개념, 회귀 분석, ＿＿＿＿, 연관 분석이 포함된다.",
        "answer": "군집 분석"
      },
      {
        "area": "데이터 모델링과 평가",
        "question": "'데이터 모델링과 평가' 영역의 과정·기능 요소로 분석을 위한 도구 탐색하기, ＿＿＿＿ 평가하기가 있다.",
        "answer": "분석 결과"
      },
      {
        "area": "데이터 모델링과 평가",
        "question": "'데이터 모델링과 평가' 영역의 가치·태도 요소로 데이터에 대한 다양한 ＿＿＿＿을 수용하는 태도가 제시된다.",
        "answer": "해석"
      },
      {
        "area": "데이터 모델링과 평가",
        "question": "'데이터 모델링과 평가' 영역의 가치·태도 요소로 적절한 ＿＿＿＿을 선택하여 적용하는 자세가 제시된다.",
        "answer": "분석 방법"
      },
      {
        "area": "데이터 과학 프로젝트",
        "question": "데이터 기반 문제 해결을 위해 데이터 과학의 기본 개념과 원리를 바탕으로 ＿＿＿＿ 과정을 수행한다.",
        "answer": "탐구"
      },
      {
        "area": "데이터 과학 프로젝트",
        "question": "데이터 과학으로 문제를 해결할 때, 통계적 방법이나 ＿＿＿＿ 등 다양한 방법을 활용한다.",
        "answer": "기계학습"
      },
      {
        "area": "데이터 과학 프로젝트",
        "question": "'데이터 과학 프로젝트' 영역의 지식·이해 요소는 데이터 과학의 주제, ＿＿＿＿, 결과의 의미 해석이다.",
        "answer": "탐색적 데이터 분석"
      },
      {
        "area": "데이터 과학 프로젝트",
        "question": "'데이터 과학 프로젝트' 영역의 과정·기능 요소 중 하나로 ＿＿＿＿로 데이터 속 의미 파악하기가 있다.",
        "answer": "탐색적 데이터 분석"
      },
      {
        "area": "데이터 과학 프로젝트",
        "question": "'데이터 과학 프로젝트' 영역의 과정·기능 요소 중 하나로 ＿＿＿＿ 방법으로 분석하기가 있다.",
        "answer": "기계학습"
      },
      {
        "area": "데이터 과학 프로젝트",
        "question": "'데이터 과학 프로젝트' 영역의 가치·태도 요소로 복잡하고 어려운 문제를 끝까지 해결하기 위해 노력하는 태도, 일반화 및 공유 과정에서 ＿＿＿＿ 등 사회적 영향 인식이 제시된다.",
        "answer": "윤리 문제"
      }
    ],
    "standard": [
      {
        "area": "데이터 과학의 이해",
        "question": "[12데과01-01] 데이터 과학의 개념을 이해하고, 문제 해결 사례를 데이터 기반 ＿＿＿＿ 상황에 적용한다.",
        "answer": "의사 결정"
      },
      {
        "area": "데이터 과학의 이해",
        "question": "정형 데이터와 ＿＿＿＿를 구분하고, 데이터 속성에서 데이터의 잠재적 가치를 파악한다.",
        "answer": "비정형 데이터"
      },
      {
        "area": "데이터 과학의 이해",
        "question": "[12데과01-03] 데이터셋의 집합인 ＿＿＿＿를 이해하고, 서로 다른 데이터셋의 데이터를 분석이 가능한 형태로 통합하는 것의 의미를 파악한다.",
        "answer": "데이터베이스"
      },
      {
        "area": "데이터 과학의 이해",
        "question": "데이터로 인한 사회 변화를 인식하고, 진로 및 직업과 관련한 ＿＿＿＿ 사례를 분석한다.",
        "answer": "데이터 기반 문제 해결"
      },
      {
        "area": "데이터 과학의 이해",
        "question": "데이터의 형태를 바탕으로 정형 데이터와 비정형 데이터를 구분하고, 정형 데이터에서 데이터 속성별 의미와 속성 간 관계를 파악하여 수집된 데이터가 분석 대상으로서 ＿＿＿＿가 있는지 판단할 수 있어야 한다.",
        "answer": "가치"
      },
      {
        "area": "데이터 과학의 이해",
        "question": "서로 다른 데이터셋 간 ＿＿＿＿을 기준으로 데이터를 통합할 수 있음을 이해하고, 데이터셋 간의 관계를 바탕으로 데이터베이스의 개념을 설명할 수 있어야 한다.",
        "answer": "공통된 속성"
      },
      {
        "area": "데이터 과학의 이해",
        "question": "대규모의 데이터를 여러 사람이 공유하기 위해서는 체계적인 시스템이 필요하다는 점을 바탕으로 ＿＿＿＿의 필요성을 설명할 수 있어야 한다.",
        "answer": "데이터베이스"
      },
      {
        "area": "데이터 과학의 이해",
        "question": "실제 활용 분야와 사례를 중심으로 데이터 과학이 어떻게 발전되어 왔는지 이해할 수 있도록 하며, ＿＿＿＿을 통한 미래 사회를 만들기 위한 데이터의 역할 및 중요성을 파악할 수 있도록 교수·학습을 구성한다.",
        "answer": "지속가능한 발전"
      },
      {
        "area": "데이터 과학의 이해",
        "question": "우리 사회의 다양한 분야에서 사용될 수 있는 데이터의 잠재적 가치를 이해하고, 데이터와 ＿＿＿＿이 활용된 문제 해결의 사례를 탐색할 수 있도록 교수·학습을 구성한다.",
        "answer": "데이터 분석"
      },
      {
        "area": "데이터 과학의 이해",
        "question": "데이터 과학에 기반한 여러 가지 문제 해결 사례를 탐색하기 어려워하는 학습자의 경우, 교수자가 제시한 사례에서 사용된 데이터가 무엇인지, 문제 해결에 어떠한 역할을 하였는지를 기반으로 데이터의 ＿＿＿＿를 설명할 수 있는지를 평가하도록 한다.",
        "answer": "잠재적 가치"
      },
      {
        "area": "데이터 준비와 분석",
        "question": "[12데과02-01] 데이터를 ＿＿＿＿ 않도록 수집하고, 수집된 데이터의 특성을 분석한다.",
        "answer": "편향되지"
      },
      {
        "area": "데이터 준비와 분석",
        "question": "이상치와 결측치 탐색 및 ＿＿＿＿를 통해 전처리하여 오류 가능성을 최소화하고, 데이터 분석을 위해 시각화한다.",
        "answer": "정규화"
      },
      {
        "area": "데이터 준비와 분석",
        "question": "데이터를 분석하기 위해 데이터 속성 간의 관계를 파악하고 ＿＿＿＿한다.",
        "answer": "통합"
      },
      {
        "area": "데이터 준비와 분석",
        "question": "[12데과02-04] 동일한 데이터를 서로 다른 ＿＿＿＿을 적용하여 분석 결과를 비교한다.",
        "answer": "분석 방법"
      },
      {
        "area": "데이터 준비와 분석",
        "question": "데이터의 선택과 수집된 데이터를 활용하는 과정에서 발생할 수 있는 ＿＿＿＿을 최소화하고, 수집된 데이터의 출처, 규모, 데이터 속성별 자료형, 간단한 통계적 특성 등 데이터의 특성을 분석하고 파악할 수 있어야 한다.",
        "answer": "편향성"
      },
      {
        "area": "데이터 준비와 분석",
        "question": "동일한 데이터에 서로 다른 분석 방법을 적용하는 경우 ＿＿＿＿가 달라질 수 있음을 이해하고, 분석 방법과 연관지어 서로 다른 결과가 나온 이유를 분석하고 비교할 수 있어야 한다.",
        "answer": "분석 결과"
      },
      {
        "area": "데이터 준비와 분석",
        "question": "데이터를 수집할 때 다양한 경로로 접근할 수 있는 공공 데이터 포털, 출처가 명확한 민간 데이터 포털을 통해 정확하고 신뢰할 수 있는 데이터를 수집하도록 활동을 구성하여 ＿＿＿＿을 기를 수 있도록 한다.",
        "answer": "데이터 문해력"
      },
      {
        "area": "데이터 준비와 분석",
        "question": "일상 속 데이터를 수집, 전처리, 분석하는 모든 과정에서 데이터 편향, ＿＿＿＿을 최소화 하기 위한 방법을 탐색하고, 관련 내용을 검증하는 과정을 교수·학습에 포함하도록 한다.",
        "answer": "오류 가능성"
      },
      {
        "area": "데이터 준비와 분석",
        "question": "데이터 전처리에 어려움을 겪는 학습자의 경우, 전처리가 비교적 간단한 데이터를 제시하여 ＿＿＿＿와 결측치를 탐색하고, 데이터 특성에 적합한 분석 방법을 제시할 수 있는지 평가하도록 한다.",
        "answer": "이상치"
      },
      {
        "area": "데이터 모델링과 평가",
        "question": "[12데과03-01] ＿＿＿＿ 개념을 이해하고 데이터 분석에 활용할 수 있는 도구를 탐색한다.",
        "answer": "데이터 모델"
      },
      {
        "area": "데이터 모델링과 평가",
        "question": "동일한 데이터를 통계적 회귀모델과 ＿＿＿＿을 통한 회귀모델로 분석하여 결과 해석 내용을 비교한다.",
        "answer": "기계학습"
      },
      {
        "area": "데이터 모델링과 평가",
        "question": "데이터의 속성에 대한 유사성을 측정하고 분석하여 ＿＿＿＿을 형성하고, 군집 분석 결과의 의미를 해석한다.",
        "answer": "군집"
      },
      {
        "area": "데이터 모델링과 평가",
        "question": "[12데과03-04] 데이터 간의 관계를 분석하고 상호 ＿＿＿＿을 파악하여 결과의 의미를 해석한다.",
        "answer": "연관성"
      },
      {
        "area": "데이터 모델링과 평가",
        "question": "데이터 분석 방법에 따른 데이터 모델의 분석 결과를 비교하고 ＿＿＿＿한다.",
        "answer": "평가"
      },
      {
        "area": "데이터 모델링과 평가",
        "question": "다양한 분석 방법을 비교하고 평가하여 ＿＿＿＿에 가장 적합한 분석 방법을 적용한다.",
        "answer": "분석 목적"
      },
      {
        "area": "데이터 모델링과 평가",
        "question": "데이터의 속성을 바탕으로 유사도가 높은 데이터끼리 묶어 다수의 군집으로 나누고 군집 내 유사성과 군집 간 ＿＿＿＿을 설명할 수 있어야 한다.",
        "answer": "상이성"
      },
      {
        "area": "데이터 모델링과 평가",
        "question": "장바구니 분석의 사례를 통해 ＿＿＿＿의 원리를 이해하고, 데이터 속성간 지지도, 신뢰도, 향상도를 측정하며 데이터 속성 간 연관 규칙을 찾아낼 수 있어야 한다.",
        "answer": "연관 분석"
      },
      {
        "area": "데이터 모델링과 평가",
        "question": "장바구니 분석의 사례를 통해 연관 분석의 원리를 이해하고, 데이터 속성간 지지도, ＿＿＿＿, 향상도를 측정하며 데이터 속성 간 연관 규칙을 찾아낼 수 있어야 한다.",
        "answer": "신뢰도"
      },
      {
        "area": "데이터 모델링과 평가",
        "question": "데이터 특성과 분석 목적에 적합한 평가 방법(예측률, 정확도 등)을 선정하고, 이를 바탕으로 데이터 분석 결과를 해석하고 그 ＿＿＿＿를 판단할 수 있어야 한다.",
        "answer": "의미"
      },
      {
        "area": "데이터 모델링과 평가",
        "question": "데이터 모델링 과정에서 다양한 데이터 분석 방법을 비교하여 활용하고, 데이터 해석 과정에서 등장하는 여러 견해를 상호 존중하고 ＿＿＿＿으로 바라봄으로써 합리적으로 문제를 해결할 수 있도록 교수·학습을 구성하도록 한다.",
        "answer": "비판적 시각"
      },
      {
        "area": "데이터 모델링과 평가",
        "question": "데이터 분석을 위한 도구는 학습자의 ＿＿＿＿을 사전에 파악하여 학습자의 인지적인 부담이 적은 방향으로 선정하도록 한다.",
        "answer": "디지털 역량"
      },
      {
        "area": "데이터 모델링과 평가",
        "question": "학습에 사용하는 기기나 운영 체제에 비교적 독립적인 소프트웨어나 프로그래밍 언어를 활용하여 다양한 학습 환경에서 학습자의 ＿＿＿＿을 보장하도록 한다.",
        "answer": "접근성"
      },
      {
        "area": "데이터 모델링과 평가",
        "question": "최소 성취수준을 보장하기 위하여 교수자가 제시한 데이터 분석 과정을 바탕으로 데이터 모델의 개념을 제시하고, 여러 가지 분석 방법을 구별하여 설명할 수 있는지 평가한다.",
        "answer": "최소 성취수준"
      },
      {
        "area": "데이터 모델링과 평가",
        "question": "비교적 명확하게 해석 결과가 도출되는 데이터셋을 제공하여 학습자가 최소한의 데이터 분석 과정을 체험하고 ＿＿＿＿을 인식할 수 있는 학습 과정을 제공하도록 한다.",
        "answer": "의미"
      },
      {
        "area": "데이터 과학 프로젝트",
        "question": "[12데과04-01] 분야별 데이터 과학의 적용 사례를 조사하여 분석하고, 데이터로 해결 가능한 주제를 찾아 ＿＿＿＿을 판단한다.",
        "answer": "적합성"
      },
      {
        "area": "데이터 과학 프로젝트",
        "question": "수집된 데이터를 ＿＿＿＿으로 분석하여 데이터 속 의미를 파악하고, 문제 해결을 위한 창의적인 방법을 구상한다.",
        "answer": "탐색적"
      },
      {
        "area": "데이터 과학 프로젝트",
        "question": "데이터 분석을 진행할 때, ＿＿＿＿개 이상의 방법을 사용하여 분석하고 결과를 비교한다.",
        "answer": "2"
      },
      {
        "area": "데이터 과학 프로젝트",
        "question": "복잡하고 어려운 문제라도 끝까지 해결하기 위한 자세를 갖추고 분석하여, 분석 결과에 대한 의미를 ＿＿＿＿한다.",
        "answer": "해석"
      },
      {
        "area": "데이터 과학 프로젝트",
        "question": "[12데과04-05] 분석을 위한 목적부터 데이터 수집 및 분석에 이르는 전 과정을 성찰하고, ＿＿＿＿을 고려하여 분석 결과의 활용방안을 탐색한다.",
        "answer": "사회적 영향"
      },
      {
        "area": "데이터 과학 프로젝트",
        "question": "동일한 데이터를 기반으로 서로 다른 데이터 전처리, 데이터 분석 방법을 적용한 결과를 비교하여 가장 적절한 ＿＿＿＿ 방법을 설계할 수 있어야 한다.",
        "answer": "데이터 모델링"
      },
      {
        "area": "데이터 과학 프로젝트",
        "question": "데이터 분석을 통한 문제 해결 과정에서 파생되는 사회적인 영향, ＿＿＿＿을 성찰하고 데이터 모델을 수정한 후, 문제 해결 결과를 일반화하고 공유할 수 있어야 한다.",
        "answer": "윤리적인 문제"
      },
      {
        "area": "데이터 과학 프로젝트",
        "question": "기후위기, 환경 문제, 에너지 문제 등의 주제를 가정, 학교, 지역 및 지구 차원에서 프로젝트 주제로 고려하여, 인류가 당면한 여러 가지 ＿＿＿＿ 문제를 데이터 과학 프로젝트를 통해 심층적으로 탐구하도록 한다.",
        "answer": "생태적"
      },
      {
        "area": "데이터 과학 프로젝트",
        "question": "여러 가지 데이터 분석 방법 중 ＿＿＿＿을 통한 분석 방법을 포함하여 분석 결과를 비교함으로써 디지털·인공지능 소양을 기를 수 있도록 교수·학습을 구성하도록 한다.",
        "answer": "기계학습"
      },
      {
        "area": "데이터 과학 프로젝트",
        "question": "프로젝트 과정에서 온라인 공유 환경을 제공하여 온오프라인의 ＿＿＿＿이 모두 일어날 수 있도록 하고, 협업 과정이 온라인 문서에 기록될 수 있도록 한다.",
        "answer": "협업"
      },
      {
        "area": "데이터 과학 프로젝트",
        "question": "주제 선정, 데이터 수집 등에서 아이디어를 발산하고 수렴하는 과정이 기록되도록 하여 프로젝트 내 ＿＿＿＿ 과정이 드러나는 데에 중점을 두도록 한다.",
        "answer": "문제 해결"
      },
      {
        "area": "데이터 과학 프로젝트",
        "question": "민주시민으로서 데이터 과학 프로젝트를 통해 생산한 정보의 사회적 영향 및 파급력에 대하여 논의할 수 있도록 ＿＿＿＿을 구성하고, 협력학습을 통해 학생들이 토론이나 토의 과정의 기회를 갖도록 한다.",
        "answer": "문제기반학습"
      }
    ],
    "teach": [
      {
        "area": "",
        "question": "실제적인 삶의 맥락에서 컴퓨팅을 통해 문제를 해결하도록 하는 학습 과제를 제시하여 학습자가 과제를 스스로 해결하는 과정에서 자연스럽게 컴퓨팅 사고력, 디지털 문화 소양, ＿＿＿＿을 함양할 수 있도록 지도한다.",
        "answer": "인공지능 소양"
      },
      {
        "area": "",
        "question": "학습자의 흥미와 다양성을 고려하여 학습 소재, 학습 환경 및 학습 과정에 대한 선택의 기회를 제공하고, 교수-학습의 설계 과정에 학습자 참여 기회를 증진하는 등 ＿＿＿＿을 통해 역량 함양을 위한 깊이 있는 학습 지도 방안을 구성한다.",
        "answer": "학습자 맞춤형 교수·학습"
      },
      {
        "area": "",
        "question": "데이터 과학 과목의 지식 이해, 과정 기능을 활용하여 민주시민교육, 생태전환 교육 등 현 시대가 당면한 여러 사회문제와 더불어 ＿＿＿＿ 등의 범교과 주제를 교수·학습 과제로 제시하여 주도성 있는 문제 해결 경험을 제공한다.",
        "answer": "지속가능발전"
      },
      {
        "area": "",
        "question": "디지털 교육 환경에 적응할 수 있도록 온오프라인 연계 수업, 다양한 디지털 도구의 활용 등을 통해 디지털 도구에 대한 인지적 부담은 최소화하고, 활용에 대한 경험은 높일 수 있도록 ＿＿＿＿을 구성한다.",
        "answer": "수업"
      },
      {
        "area": "",
        "question": "데이터 과학에 대한 이해를 통해 디지털 사회에서 데이터 기반의 사회 변화에 적극적으로 대응할 수 있는 태도와 능력을 함양할 수 있도록 교수·학습을 ＿＿＿＿한다.",
        "answer": "설계"
      },
      {
        "area": "",
        "question": "프로젝트형 실습은 협업을 통해 의사 소통 능력, 협력적 문제 해결력, ＿＿＿＿ 인식 등을 함양하도록 한다.",
        "answer": "공유의 가치"
      },
      {
        "area": "",
        "question": "특정 데이터 과학 기술이나 도구의 사용법 습득에 치중하지 않도록 유의하고, 문제 해결을 위한 데이터 과학 기술의 활용, 프로젝트 설계 및 수행을 통해 ＿＿＿＿과 인공지능 소양을 함양하는 데 중점을 둔다.",
        "answer": "데이터 문해력"
      },
      {
        "area": "",
        "question": "교과 역량을 함양하기 위해 문제기반학습, 프로젝트 기반학습, 디자인기반학습, ＿＿＿＿, 탐구학습 등 각 영역의 핵심 아이디어를 습득하는 데 적절한 교수·학습 방법을 선택하여 활용한다.",
        "answer": "짝 프로그래밍"
      },
      {
        "area": "",
        "question": "학습자 개인별로 학습하는 속도가 다양할 수 있음을 고려하고, 최소 성취수준을 보장할 수 있도록 ＿＿＿＿을 활용하여 온라인 학습자료를 제작 및 제공함으로써 학습 격차를 최소화하도록 노력한다.",
        "answer": "학습관리시스템(LMS)"
      },
      {
        "area": "",
        "question": "데이터를 수집하고 분석하는 과정에서 토의·토론을 통해 데이터 편향성, 윤리 문제 등 사회적 영향력을 판단하여 의사 결정할 수 있는 과정을 포함한다. ＿＿＿＿ 과정에서는 토의·토론을 통해 다양한 데이터 분석 방법을 비교하여 선정하고 비판적 시각으로 결과를 해석할 수 있도록 안내한다.",
        "answer": "데이터 모델링"
      },
      {
        "area": "",
        "question": "학습자의 ＿＿＿＿와 연계된 주제의 프로젝트를 선택하도록 하여, 학습자가 데이터 과학 기술의 활용과 자신의 미래를 연결하여 생각할 수 있도록 수업을 구성한다.",
        "answer": "진로"
      },
      {
        "area": "",
        "question": "프로젝트 활동 과정에서 협업에 필요한 다양한 디지털 도구를 활용할 수 있으며, 학생들이 손쉽게 활용할 수 있는 디지털 도구를 도입하여 원격수업이나 협업 활동에서 디지털 도구 활용 방법을 익히는 데 ＿＿＿＿을 최소화한다.",
        "answer": "인지적 부담"
      }
    ],
    "evaluation": [
      {
        "area": "",
        "question": "평가 항목은 컴퓨팅 사고력, 디지털 문화 소양, ＿＿＿＿의 하위 요소를 기반으로 구체화한다.",
        "answer": "인공지능 소양"
      },
      {
        "area": "",
        "question": "평가 내용은 지식 이해뿐 아니라, 과정 기능, ＿＿＿＿의 측면 등을 다면적으로 반영하고 과정을 중시하는 평가를 통해 학생의 성장과 발달을 돕는 평가를 실현한다.",
        "answer": "가치 태도"
      },
      {
        "area": "",
        "question": "구체적인 평가 루브릭을 학생과 함께 구성하는 과정을 통해 학생이 자신의 학습 수준을 파악하고 스스로 학습을 ＿＿＿＿할 수 있는 기회를 제공하여, 적극적이고 능동적인 학습이 이루어지도록 한다.",
        "answer": "성찰"
      },
      {
        "area": "",
        "question": "작성한 프로그램의 정확성, 효율성과 더불어 프로그램 설계 과정의 논리성과 실습 과정을 통해 ＿＿＿＿의 과정을 이해하고 있는지에 중점을 두고 평가한다.",
        "answer": "데이터 모델링"
      },
      {
        "area": "",
        "question": "모둠별 탐구 활동의 성과물에 대한 평가뿐만 아니라 협업 및 발표, 토론 수행 등의 전과정에서 합리적이고 객관적인 평가가 이루어질 수 있도록 평가기준과 구체적인 체크리스트를 마련하고, 이를 교사 평가뿐만 아니라 ＿＿＿＿, 동료 평가의 도구로 활용한다.",
        "answer": "자기 평가"
      },
      {
        "area": "",
        "question": "성취기준을 분석하고 재구성하여 지필평가에 국한하지 않고, 학생의 성장에 기여할 수 있는 ＿＿＿＿를 계획한다.",
        "answer": "평가 포트폴리오"
      },
      {
        "area": "",
        "question": "평가 내용이나 방법에 따라 다양한 디지털 도구(프로그램 자동 평가시스템(＿＿＿＿ 등), 학습관리시스템(LMS) 등)를 활용할 수 있으며, 평가 이전에 학생이 디지털 도구를 다룰 수 있도록 교육하여 평가의 불이익이 없도록 계획한다.",
        "answer": "online judge"
      },
      {
        "area": "",
        "question": "실습 과제를 평가할 경우, 산출물 평가와 더불어 ＿＿＿＿을 꾸준히 관찰하여 학생의 학습 과정을 종합적으로 평가한다.",
        "answer": "과제 해결 과정"
      },
      {
        "area": "",
        "question": "협업 프로젝트를 평가할 때는 학습자별 역할을 구체적으로 기록하고, ＿＿＿＿를 통해 모둠원에서 활동했던 비중을 논의하여 제시하도록 함으로써 최대한 공정성을 확보한다.",
        "answer": "동료 평가"
      },
      {
        "area": "",
        "question": "효율적인 평가를 위하여 다양한 디지털 도구를 활용할 수 있으나 학생이 ＿＿＿＿으로 인해 평가에 불이익을 받지 않도록 디지털 도구의 사용법을 익히는 데 부담을 최소화하거나 충분히 익힐 기회를 제공한다.",
        "answer": "디지털 도구 활용의 미숙"
      }
    ]
  },
  "software-life": {
    "goal": [
      {
        "area": "",
        "question": "'정보'과는 인공지능으로 정의되는 사회에서 데이터와 정보로 인한 디지털 세상의 변화를 인식하고, 정보의 사회적 가치를 탐구하며, 정보를 처리하는 다양한 원리와 기술에 기반한 ＿＿＿＿을 바탕으로 실생활 및 다양한 학문 분야의 문제를 해결하는 능력과 태도를 기르는 교과이다.",
        "answer": "컴퓨팅 사고력"
      },
      {
        "area": "",
        "question": "'정보'는 디지털 대전환 시대의 국가사회적 요구에 부응하여, ＿＿＿＿을 활용한 문제 해결을 위해 사회 구성원이 갖추어야 할 필수 역량을 제공한다.",
        "answer": "컴퓨팅"
      },
      {
        "area": "",
        "question": "'정보'의 학문적 기저는 컴퓨터에서 처리되는 데이터와 정보의 원리, 컴퓨팅 시스템을 설계하고 구현하는 기술과 방법, ＿＿＿＿에 대한 이해 등을 포괄하고 있다.",
        "answer": "정보를 다루는 인간 사회"
      },
      {
        "area": "",
        "question": "'정보'는 컴퓨터 과학뿐 아니라 데이터 과학, 인공지능, 정보기술, 정보시스템, ＿＿＿＿ 등의 분야를 포괄하는 정보학에 대한 기본 개념과 원리를 기반으로 한다.",
        "answer": "소프트웨어 공학"
      },
      {
        "area": "",
        "question": "교과의 이러한 특성은 사회 각 분야에서 요구되는 소프트웨어와 인공지능에 대한 기본 소양을 갖추고, 공학뿐만 아니라 자연과학, 인문·사회과학, 예술과 체육 등 다양한 학문 분야에서 문제를 창의적으로 해결하는 ＿＿＿＿ 양성에 도움을 준다.",
        "answer": "인재"
      },
      {
        "area": "",
        "question": "'소프트웨어와 생활'은 소프트웨어에 대한 기본 개념과 원리를 실생활 및 다양한 학문 분야의 문제 해결에 ＿＿＿＿이고 협력적으로 적용하는 과정을 경험할 수 있게 한다.",
        "answer": "융합적"
      },
      {
        "area": "",
        "question": "학생들은 소프트웨어와 각 분야와의 융합에 대한 가치와 중요성을 인식하고, 소프트웨어를 적용한 표현 및 데이터 분석과 활용, 소프트웨어를 통한 ＿＿＿＿ 구현 등을 경험함으로써 문제를 융합적이고 창의적으로 해결하는 능력을 갖춘 디지털 민주시민으로 성장하게 된다.",
        "answer": "시뮬레이션"
      },
      {
        "area": "",
        "question": "서로 다른 분야의 융합, 융합을 통한 창의적 문제 해결의 경험을 기반으로 소프트웨어를 활용한 문제 해결의 중요성을 체득하고, 다양한 분야의 ＿＿＿＿를 탐색하게 된다.",
        "answer": "진로"
      },
      {
        "area": "",
        "question": "'소프트웨어와 생활'은 디지털 사회에서 실생활 및 다양한 학문 분야의 문제 해결에 융합되어 새로운 가치를 창출하는 소프트웨어의 가치와 필요성을 인식하고, 직면한 문제를 융합의 관점에서 효과적이고 창의적으로 해결하는 능력을 함양하여 사회에 기여할 수 있는 ＿＿＿＿과 태도를 기르는 데 중점을 둔다.",
        "answer": "가치관"
      },
      {
        "area": "",
        "question": "(1) 실생활이나 다양한 학문 분야에서 활용되는 소프트웨어의 가치와 필요성을 파악하고, 소프트웨어를 통해 해결 가능한 ＿＿＿＿를 발견하기 위한 능력과 태도를 기른다.",
        "answer": "문제"
      },
      {
        "area": "",
        "question": "(2) 소프트웨어와 하드웨어를 활용한 표현 방법에 대한 이해를 바탕으로, 생각이나 현상을 효과적으로 전달하는 데 적합한 방법을 선택하여 ＿＿＿＿할 수 있는 능력을 기른다.",
        "answer": "표현"
      },
      {
        "area": "",
        "question": "(3) 사회 각 분야에서 발생하는 데이터를 목적에 맞게 수집·가공·분석하고, 그 의미를 소프트웨어와의 ＿＿＿＿ 관점에서 해석할 수 있는 능력을 함양한다.",
        "answer": "융합적인"
      },
      {
        "area": "",
        "question": "(4) 실생활이나 다양한 학문 분야의 문제를 해결하기 위한 소프트웨어 구현의 필요성을 인지하고, ＿＿＿＿하여 프로그램을 구현 및 개선할 수 있는 능력을 기른다.",
        "answer": "시뮬레이션"
      },
      {
        "area": "",
        "question": "(5) ＿＿＿＿ 사례를 탐색하고, 창의적인 아이디어를 바탕으로 사회에 기여할 수 있는 소프트웨어를 개발하는 프로젝트를 수행하는 능력과 태도를 기른다.",
        "answer": "소프트웨어 스타트업"
      }
    ],
    "content": [
      {
        "area": "세상을 변화시키는 소프트웨어",
        "question": "디지털 기술의 발전에 따라 소프트웨어는 인간의 삶과 ＿＿＿＿ 전반을 변화시키고 있다.",
        "answer": "사회"
      },
      {
        "area": "세상을 변화시키는 소프트웨어",
        "question": "학문 분야와 소프트웨어의 융합은 세상의 문제와 현상을 효과적으로 탐구하고 해결하는 데 ＿＿＿＿을 준다.",
        "answer": "도움"
      },
      {
        "area": "세상을 변화시키는 소프트웨어",
        "question": "'세상을 변화시키는 소프트웨어' 영역의 지식 요소는 소프트웨어와 사회 변화, ＿＿＿＿과 문제 해결이다.",
        "answer": "소프트웨어 융합"
      },
      {
        "area": "세상을 변화시키는 소프트웨어",
        "question": "'세상을 변화시키는 소프트웨어' 영역의 과정 기능으로 소프트웨어를 통해 세상을 변화시킨 사례 탐색하기, 소프트웨어의 발전에 따른 ＿＿＿＿ 예측하기가 있다.",
        "answer": "미래 사회"
      },
      {
        "area": "세상을 변화시키는 소프트웨어",
        "question": "'세상을 변화시키는 소프트웨어' 영역의 과정 기능으로 소프트웨어와의 융합을 통한 ＿＿＿＿이 가능한 사례 탐색하기가 있다.",
        "answer": "문제 해결"
      },
      {
        "area": "세상을 변화시키는 소프트웨어",
        "question": "'세상을 변화시키는 소프트웨어' 영역의 가치·태도로 문제와 현상을 소프트웨어의 관점으로 바라보는 자세와 실생활 및 다양한 학문 분야의 문제 해결에 소프트웨어를 ＿＿＿＿하는 자세가 있다.",
        "answer": "적용"
      },
      {
        "area": "창작을 지원하는 소프트웨어",
        "question": "다양한 장치와 센서를 소프트웨어를 통해 작품과 결합함으로써 작품의 ＿＿＿＿을 지원한다.",
        "answer": "창작"
      },
      {
        "area": "창작을 지원하는 소프트웨어",
        "question": "＿＿＿＿을 통한 작품 창작은 생각을 현실화하고, 문제를 해결하는 데 도움을 준다.",
        "answer": "피지컬 컴퓨팅"
      },
      {
        "area": "창작을 지원하는 소프트웨어",
        "question": "'창작을 지원하는 소프트웨어' 영역의 지식 요소는 피지컬 컴퓨팅 도구, ＿＿＿＿, 웨어러블 장치이다.",
        "answer": "미디어 아트"
      },
      {
        "area": "창작을 지원하는 소프트웨어",
        "question": "'창작을 지원하는 소프트웨어' 영역의 과정 기능으로 ＿＿＿＿ 시스템의 구성 및 작동 원리 분석하기가 있다.",
        "answer": "피지컬 컴퓨팅"
      },
      {
        "area": "창작을 지원하는 소프트웨어",
        "question": "'창작을 지원하는 소프트웨어' 영역의 과정 기능으로 목적에 맞는 ＿＿＿＿와 액추에이터 탐색하기, 피지컬 컴퓨팅을 통해 작품 구현하기가 있다.",
        "answer": "센서"
      },
      {
        "area": "창작을 지원하는 소프트웨어",
        "question": "'창작을 지원하는 소프트웨어' 영역의 가치·태도는 소프트웨어를 통한 아이디어 표현의 다양성과 유연성, 다양한 분야에서 활용된 소프트웨어의 가치 ＿＿＿＿이다.",
        "answer": "성찰"
      },
      {
        "area": "현상을 분석하는 소프트웨어",
        "question": "데이터를 다루는 소프트웨어는 사회 각 분야에서 발생하는 방대한 데이터를 효율적으로 수집, 가공, ＿＿＿＿하는 데 활용된다.",
        "answer": "분석"
      },
      {
        "area": "현상을 분석하는 소프트웨어",
        "question": "데이터 분석은 다양한 분야의 현상을 ＿＿＿＿으로 해석할 수 있도록 도움을 준다.",
        "answer": "합리적"
      },
      {
        "area": "현상을 분석하는 소프트웨어",
        "question": "'현상을 분석하는 소프트웨어' 영역의 지식 요소는 데이터 유형별, 수집 방법, 데이터 ＿＿＿＿와 분석이다.",
        "answer": "시각화"
      },
      {
        "area": "현상을 분석하는 소프트웨어",
        "question": "'현상을 분석하는 소프트웨어' 영역의 과정 기능으로 다양한 분야의 데이터 탐색하기, 데이터 ＿＿＿＿하고 관리하기가 있다.",
        "answer": "처리"
      },
      {
        "area": "현상을 분석하는 소프트웨어",
        "question": "'현상을 분석하는 소프트웨어' 영역의 가치·태도로 데이터의 사회적 가치 인식과 데이터 분석 결과를 ＿＿＿＿으로 활용하는 태도가 있다.",
        "answer": "윤리적"
      },
      {
        "area": "모의 실험하는 소프트웨어",
        "question": "실제와 비슷한 모형을 소프트웨어로 구현한 ＿＿＿＿은 복잡한 문제나 현상의 원리를 탐구하고, 개념을 이해하는 데 도움을 준다.",
        "answer": "시뮬레이션"
      },
      {
        "area": "모의 실험하는 소프트웨어",
        "question": "소프트웨어 시뮬레이션을 통해 실세계에서 실행하기에 어렵거나 불가능한 대상을 ＿＿＿＿으로 실행한다.",
        "answer": "모의적"
      },
      {
        "area": "모의 실험하는 소프트웨어",
        "question": "'모의 실험하는 소프트웨어' 영역의 지식 요소는 시뮬레이션의 개념과 구성요소, 시뮬레이션 활용 분야, 시뮬레이션 ＿＿＿＿이다.",
        "answer": "모델"
      },
      {
        "area": "모의 실험하는 소프트웨어",
        "question": "'모의 실험하는 소프트웨어' 영역의 과정 기능으로 시뮬레이션 프로그램 활용하기, 시뮬레이션 모델 구성하기, 시뮬레이션을 위한 ＿＿＿＿ 구현하기가 있다.",
        "answer": "소프트웨어"
      },
      {
        "area": "모의 실험하는 소프트웨어",
        "question": "'모의 실험하는 소프트웨어' 영역의 가치·태도는 시뮬레이션의 가치 인식, 소프트웨어를 활용한 현실 세계 모델링에 적극적으로 ＿＿＿＿하는 태도이다.",
        "answer": "도전"
      },
      {
        "area": "가치를 창출하는 소프트웨어",
        "question": "소프트웨어 스타트업은 창의적인 아이디어를 실제로 구현하고, 사회적 ＿＿＿＿ 가치를 창출한다.",
        "answer": "경제적"
      },
      {
        "area": "가치를 창출하는 소프트웨어",
        "question": "소프트웨어 스타트업 프로젝트는 윤리적이고 ＿＿＿＿인 문제 해결 과정이 필요하다.",
        "answer": "협력적"
      },
      {
        "area": "가치를 창출하는 소프트웨어",
        "question": "'가치를 창출하는 소프트웨어' 영역의 지식 요소는 소프트웨어 스타트업의 개념, 소프트웨어 스타트업 ＿＿＿＿이다.",
        "answer": "프로젝트"
      },
      {
        "area": "가치를 창출하는 소프트웨어",
        "question": "'가치를 창출하는 소프트웨어' 영역의 과정 기능으로 소프트웨어 스타트업 사례 탐색하기, ＿＿＿＿의 요구 분석하기가 있다.",
        "answer": "사용자"
      },
      {
        "area": "가치를 창출하는 소프트웨어",
        "question": "'가치를 창출하는 소프트웨어' 영역의 과정 기능으로 스타트업 아이디어 표현하기, 스타트업 프로젝트에 적합한 소프트웨어 ＿＿＿＿하기가 있다.",
        "answer": "구현"
      },
      {
        "area": "가치를 창출하는 소프트웨어",
        "question": "'가치를 창출하는 소프트웨어' 영역의 가치·태도는 소프트웨어와 융합을 통해 새로운 가치를 창출하는 자세, 협력적으로 문제를 해결하고 공유하는 태도, 개발한 소프트웨어의 가치에 대한 ＿＿＿＿이다.",
        "answer": "성찰"
      }
    ],
    "standard": [
      {
        "area": "세상을 변화시키는 소프트웨어",
        "question": "[12소생01-01] 소프트웨어가 세상을 변화시킨 사례를 탐색하고 소프트웨어가 ＿＿＿＿에 미치는 영향을 분석한다.",
        "answer": "사회 변화"
      },
      {
        "area": "세상을 변화시키는 소프트웨어",
        "question": "실세계의 문제와 현상을 소프트웨어의 관점으로 바라보고 소프트웨어 발전에 따른 미래 사회의 변화를 예측한다는 성취기준의 코드는 ＿＿＿＿이다.",
        "answer": "[12소생01-02]"
      },
      {
        "area": "세상을 변화시키는 소프트웨어",
        "question": "[12소생01-03] 소프트웨어 융합을 통한 문제 해결 사례를 바탕으로, 다양한 학문 분야에서 소프트웨어와의 융합을 통해 문제를 해결하는 방법을 ＿＿＿＿한다.",
        "answer": "비교·분석"
      },
      {
        "area": "세상을 변화시키는 소프트웨어",
        "question": "[12소생01-02] 해설: 세상의 문제와 현상에 대한 구체적 사례와 특징을 소프트웨어 기술을 도입하기 전과 후로 구분하여 분석하고 이를 바탕으로 ＿＿＿＿의 흐름을 파악할 수 있어야 한다.",
        "answer": "사회 변화"
      },
      {
        "area": "세상을 변화시키는 소프트웨어",
        "question": "[12소생01-03] 해설: 인문, 사회, 과학, 예술 등 다양한 학문 분야에서 소프트웨어와 융합으로 문제가 해결되거나 발전한 구체적인 사례를 탐색하여 소프트웨어와의 융합을 통한 문제 해결이 가지는 ＿＿＿＿을 설명할 수 있어야 한다.",
        "answer": "장점"
      },
      {
        "area": "세상을 변화시키는 소프트웨어",
        "question": "일반적인 자료(인터넷 기사, 동영상 등) 및 전문 자료(보고서, 논문 등) 검색을 통해 세상을 변화시킨 소프트웨어의 사례에 대해 학생들이 ＿＿＿＿으로 탐색 및 분석할 수 있는 활동을 제공한다.",
        "answer": "비판적"
      },
      {
        "area": "세상을 변화시키는 소프트웨어",
        "question": "학생들이 인식한 세상의 변화에 대해 논의하는 활동을 중심으로 교수·학습을 구성하여 학생들이 근거를 기반으로 ＿＿＿＿으로 의사 소통하는 능력을 함양하도록 한다.",
        "answer": "민주적"
      },
      {
        "area": "세상을 변화시키는 소프트웨어",
        "question": "다양한 학문 분야 및 지역사회와 국가 차원의 다양한 이슈에 대해 소프트웨어 기술을 융합하여 문제를 해결한 사례를 구체적으로 살펴보도록 ＿＿＿＿을 구성한다.",
        "answer": "교수·학습"
      },
      {
        "area": "창작을 지원하는 소프트웨어",
        "question": "[12소생02-01] 피지컬 컴퓨팅 도구로 구현된 작품의 구성 및 ＿＿＿＿ 원리를 분석한다.",
        "answer": "작동"
      },
      {
        "area": "창작을 지원하는 소프트웨어",
        "question": "[12소생02-02] 소프트웨어를 통해 아이디어를 표현하는 데 필요한 센서와 액추에이터를 선택하여 ＿＿＿＿ 시스템을 구성한다.",
        "answer": "피지컬 컴퓨팅"
      },
      {
        "area": "창작을 지원하는 소프트웨어",
        "question": "[12소생02-03] 피지컬 컴퓨팅을 통해 ＿＿＿＿ 작품을 창작하고, 창작에 활용된 소프트웨어의 가치를 파악한다.",
        "answer": "미디어 아트"
      },
      {
        "area": "창작을 지원하는 소프트웨어",
        "question": "[12소생02-04] ＿＿＿＿ 장치 작품을 창작하고 공유하는 과정을 통해 소프트웨어의 가치를 확산한다.",
        "answer": "웨어러블"
      },
      {
        "area": "창작을 지원하는 소프트웨어",
        "question": "[12소생02-01] 해설: 피지컬 컴퓨팅 도구로 구현된 작품 또는 장치를 분석하여 센서나 액추에이터의 기능과 역할을 설명하고, 센서나 액추에이터를 다양한 용도로 ＿＿＿＿하게 활용할 수 있음을 인식할 수 있어야 한다.",
        "answer": "유연"
      },
      {
        "area": "창작을 지원하는 소프트웨어",
        "question": "원격수업 등 피지컬 컴퓨팅 도구를 활용하기 어려운 경우 소프트웨어 기반의 ＿＿＿＿를 활용하여 교수·학습을 구성하도록 한다.",
        "answer": "가상 시뮬레이터"
      },
      {
        "area": "창작을 지원하는 소프트웨어",
        "question": "예술 분야와 피지컬 컴퓨팅이 융합될 때 두 분야의 ＿＿＿＿ 범위가 확장될 수 있음을 이해하도록 한다.",
        "answer": "표현"
      },
      {
        "area": "창작을 지원하는 소프트웨어",
        "question": "최소 성취수준을 보장하기 위하여 학습자의 수준에 맞는 피지컬 컴퓨팅 활동을 계획하고, 물리적인 구현이 이루어지지 않더라도 아이디어 발산, 설계 계획 수립 등 학습 과정에 대한 ＿＿＿＿가 이루어지도록 한다.",
        "answer": "평가"
      },
      {
        "area": "현상을 분석하는 소프트웨어",
        "question": "[12소생03-01] 사회 현상을 분석할 수 있는 데이터의 중요성과 가치를 인식하고, 데이터를 탐색하여 ＿＿＿＿ 방안을 구상한다.",
        "answer": "활용"
      },
      {
        "area": "현상을 분석하는 소프트웨어",
        "question": "[12소생03-02] 데이터 유형에 따라 적합한 방법으로 데이터를 ＿＿＿＿하고, 목적에 맞게 처리하고 관리한다.",
        "answer": "수집"
      },
      {
        "area": "현상을 분석하는 소프트웨어",
        "question": "[12소생03-03] 데이터를 분석하고 시각화하여 다양한 ＿＿＿＿의 의미를 해석한다.",
        "answer": "사회 현상"
      },
      {
        "area": "현상을 분석하는 소프트웨어",
        "question": "[12소생03-04] 데이터의 사회적 가치에 대한 이해를 토대로 데이터를 분석하고 의미를 파악한 후, 결과를 ＿＿＿＿으로 활용한다.",
        "answer": "윤리적"
      },
      {
        "area": "현상을 분석하는 소프트웨어",
        "question": "[12소생03-01] 해설: 공공 및 민간 데이터 제공 플랫폼을 통해 문제 해결에 필요한 데이터를 탐색하고, 탐색한 데이터의 ＿＿＿＿ 방안을 파악할 수 있어야 한다.",
        "answer": "활용"
      },
      {
        "area": "현상을 분석하는 소프트웨어",
        "question": "[12소생03-02] 해설: 수집 의도에 맞는 데이터 유형(정형데이터, 비정형데이터 등)에 따라 알맞은 데이터 수집 방법이나 도구를 선택하고, 수집한 데이터에서 필요한 부분과 필요하지 않은 부분을 구분하여 데이터를 ＿＿＿＿하고 저장할 수 있어야 한다.",
        "answer": "정제"
      },
      {
        "area": "현상을 분석하는 소프트웨어",
        "question": "개인 정보가 포함된 데이터의 경우 개인 정보가 식별되지 않도록 처리하고, 결과 예측에 ＿＿＿＿이 생길 가능성을 사전에 점검하도록 한다.",
        "answer": "편향"
      },
      {
        "area": "현상을 분석하는 소프트웨어",
        "question": "현상을 분석하기 위한 문제 상황, 해결 동기 및 목적, 데이터의 수집 및 관리, 분석 방법 및 과정, 결과 해석 등 일련의 수행 과정을 보고서, ＿＿＿＿ 등으로 누적하도록 한다.",
        "answer": "포트폴리오"
      },
      {
        "area": "모의 실험하는 소프트웨어",
        "question": "[12소생04-01] 시뮬레이션 프로그램의 개념과 구성요소를 이해하고 ＿＿＿＿를 파악한다.",
        "answer": "가치"
      },
      {
        "area": "모의 실험하는 소프트웨어",
        "question": "[12소생04-02] 다양한 시뮬레이션 프로그램의 ＿＿＿＿ 분야를 탐색하고 활용 방안을 구상한다.",
        "answer": "활용"
      },
      {
        "area": "모의 실험하는 소프트웨어",
        "question": "[12소생04-03] 시뮬레이션 프로그램 구성 방법에 따라 복잡한 문제나 현상의 원리를 ＿＿＿＿ 모델로 표현한다.",
        "answer": "시뮬레이션"
      },
      {
        "area": "모의 실험하는 소프트웨어",
        "question": "[12소생04-04] 소프트웨어를 적극적으로 활용하여 시뮬레이션 모델을 ＿＿＿＿한다.",
        "answer": "구현"
      },
      {
        "area": "모의 실험하는 소프트웨어",
        "question": "[12소생04-01] 해설: 시뮬레이션 프로그램 제작을 위해 화면 구성, 구현 기능 등의 요소를 파악하고 시뮬레이션의 실제적 활용을 통해 시뮬레이션의 필요성과 ＿＿＿＿을 인식할 수 있어야 한다.",
        "answer": "역할"
      },
      {
        "area": "모의 실험하는 소프트웨어",
        "question": "[12소생04-02] 해설: 예측, 실험, 게임 등 다양한 분야에서 시뮬레이션 프로그램이 활용된 목적과 방법을 바탕으로 구현하려는 시뮬레이션의 화면 및 기능을 ＿＿＿＿할 수 있어야 한다.",
        "answer": "계획"
      },
      {
        "area": "모의 실험하는 소프트웨어",
        "question": "시뮬레이션 프로그램의 활용이 현실의 자원 사용을 절약하게 함으로써 궁극적으로 ＿＿＿＿ 발전에도 기여할 수 있음을 안내하도록 한다.",
        "answer": "지속가능한"
      },
      {
        "area": "모의 실험하는 소프트웨어",
        "question": "최소 성취수준을 보장하기 위하여 시뮬레이션 프로그램을 제작하지 못하더라도 시뮬레이션이 활용될 수 있는 다양한 ＿＿＿＿를 도출하도록 한다.",
        "answer": "아이디어"
      },
      {
        "area": "가치를 창출하는 소프트웨어",
        "question": "[12소생05-01] 소프트웨어 스타트업의 개념을 이해하고 새로운 가치를 창출하는 소프트웨어 스타트업 ＿＿＿＿를 분석한다.",
        "answer": "사례"
      },
      {
        "area": "가치를 창출하는 소프트웨어",
        "question": "[12소생05-02] 소프트웨어 스타트업 프로젝트의 수행 과정을 이해하고, ＿＿＿＿ 요구를 분석하여 소프트웨어 스타트업 아이디어를 구안한다.",
        "answer": "사용자"
      },
      {
        "area": "가치를 창출하는 소프트웨어",
        "question": "[12소생05-03] 스타트업 프로젝트에 적합한 소프트웨어를 ＿＿＿＿으로 설계하고 구현한다.",
        "answer": "협력적"
      },
      {
        "area": "가치를 창출하는 소프트웨어",
        "question": "[12소생05-04] 개발한 소프트웨어의 가치를 사회적, 기능적, ＿＿＿＿ 관점에서 평가한다.",
        "answer": "윤리적"
      },
      {
        "area": "가치를 창출하는 소프트웨어",
        "question": "[12소생05-01] 해설: 창업과 스타트업의 차이를 파악하고 소프트웨어 스타트업의 성공 사례와 실패 사례를 바탕으로 스타트업 프로젝트 기획 방법, 스타트업 운영 시 ＿＿＿＿ 등을 분석할 수 있어야 한다.",
        "answer": "고려 사항"
      },
      {
        "area": "가치를 창출하는 소프트웨어",
        "question": "[12소생05-02] 해설: 사용자 요구 분석을 통한 주제 선정, 해결 아이디어 구안, 소프트웨어 설계 및 제작, 소프트웨어 ＿＿＿＿의 절차로 수행되는 소프트웨어 스타트업 프로젝트의 수행 과정을 이해하고 적용할 수 있어야 한다.",
        "answer": "평가"
      },
      {
        "area": "가치를 창출하는 소프트웨어",
        "question": "소프트웨어 스타트업 프로젝트를 협력적으로 수행할 수 있도록 활동을 구성하고, 프로젝트 계획 단계에서 구성원의 ＿＿＿＿와 역할을 명확히 분담하도록 한다.",
        "answer": "임무"
      },
      {
        "area": "가치를 창출하는 소프트웨어",
        "question": "소프트웨어 스타트업 프로젝트의 주제 선정 시 사회적 필요성과 가치 등을 고려하여 실생활, 교과 내, ＿＿＿＿ 내용을 융합할 수 있는 주제를 선정하도록 한다.",
        "answer": "교과 간"
      },
      {
        "area": "가치를 창출하는 소프트웨어",
        "question": "협력적 프로젝트의 수행 과정을 평가할 때는 학습자 간 유의미한 상호 작용이 이루어졌는지, 구성원 각자의 역할을 ＿＿＿＿ 있게 수행하였는지 등을 종합적으로 고려하도록 한다.",
        "answer": "책임감"
      }
    ],
    "teach": [
      {
        "area": "",
        "question": "(가) 실제적인 삶의 맥락에서 컴퓨팅을 통해 문제를 해결하도록 하는 학습 과제를 제시하여 학습자가 과제를 스스로 해결하는 과정에서 자연스럽게 컴퓨팅 사고력, 디지털 문화 소양, ＿＿＿＿ 소양을 함양할 수 있도록 지도한다.",
        "answer": "인공지능"
      },
      {
        "area": "",
        "question": "(나) 학습자의 흥미와 다양성을 고려하여 학습 소재, 학습 환경 및 학습 과정에 대한 선택의 기회를 제공하고, 교수-학습의 설계 과정에 학습자 참여 기회를 증진하는 등 ＿＿＿＿ 교수·학습을 통해 역량 함양을 위한 깊이 있는 학습 지도 방안을 구성한다.",
        "answer": "학습자 맞춤형"
      },
      {
        "area": "",
        "question": "(다) '소프트웨어와 생활' 과목의 지식 이해, 과정 기능을 활용하여 민주시민교육, ＿＿＿＿ 교육 등 현 시대가 당면한 여러 사회문제와 더불어 지속가능발전 등의 범교과 주제를 교수·학습 과제로 제시한다.",
        "answer": "생태전환"
      },
      {
        "area": "",
        "question": "(라) 디지털 교육 환경에 적응할 수 있도록 온오프라인 연계 수업, 다양한 디지털 도구의 활용 등을 통해 디지털 도구에 대한 ＿＿＿＿ 부담은 최소화하고, 활용에 대한 경험은 높일 수 있도록 수업을 구성한다.",
        "answer": "인지적"
      },
      {
        "area": "",
        "question": "(마) '소프트웨어와 생활' 과목의 교수·학습에서는 교과 간, 교과 내 영역 간의 연계성을 고려하여 학습 경험을 조직함으로써 ＿＿＿＿ 사고력을 함양할 수 있도록 한다.",
        "answer": "융합적"
      },
      {
        "area": "",
        "question": "융합적 문제 해결이 단편적인 경험을 넘어 의미 있는 문제 해결이 되도록 함으로써 삶 속에서 학습의 ＿＿＿＿가 일어날 수 있도록 한다.",
        "answer": "전이"
      },
      {
        "area": "",
        "question": "(가) 교과 역량을 함양하기 위해 문제기반학습, 프로젝트 기반학습, ＿＿＿＿, 짝 프로그래밍, 탐구학습 등 각 영역의 핵심 아이디어를 습득하는 데 적절한 교수·학습 방법을 선택하여 활용한다.",
        "answer": "디자인기반학습"
      },
      {
        "area": "",
        "question": "'소프트웨어와 생활' 과목은 전 영역에서 실생활 체험 및 응용을 위한 ＿＿＿＿ 활동을 적극적으로 활용할 수 있다.",
        "answer": "프로젝트"
      },
      {
        "area": "",
        "question": "(나) 학습자 개인별로 학습하는 속도가 다양할 수 있음을 고려하고, 최소 성취수준을 보장할 수 있도록 ＿＿＿＿을 활용하여 온라인 학습자료를 제작 및 제공함으로써 학습 격차를 최소화하도록 노력한다.",
        "answer": "학습관리시스템(LMS)"
      },
      {
        "area": "",
        "question": "(다) 프로젝트 활동에 있어 ＿＿＿＿ 선정을 어려워하는 경우, 그 범위를 구체적으로 제한하여 제시할 수 있다.",
        "answer": "주제"
      },
      {
        "area": "",
        "question": "예시) 자유주제를 제시하는 대신 '＿＿＿＿'와 같은 구체적인 주제를 제시한다.",
        "answer": "생태계 보호"
      },
      {
        "area": "",
        "question": "(라) 프로젝트 활동을 위한 모둠을 구성할 때, 모둠을 구성하기 전에 프로젝트에 관련된 공통 주제를 논의하고, 공통 주제를 중심으로 모둠을 구성함으로써 활동에 ＿＿＿＿할 수 있도록 한다.",
        "answer": "몰입"
      },
      {
        "area": "",
        "question": "예시) '해양 생태계 보호' 프로젝트에 대해 '해양 생물 멸종', '해양 산성화', '＿＿＿＿' 등의 주제가 도출되었다면, 같은 주제에 관심 있는 학생들끼리 모둠을 구성하도록 한다.",
        "answer": "바다 쓰레기"
      },
      {
        "area": "",
        "question": "(마) 협업 프로젝트 활동에서 학습 과정과 결과를 쉽게 공유할 수 있도록 공유 문서, 메신저, 이메일 등 디지털 기술을 적극적으로 활용하고, 학습자 간 상호 소통할 때 ＿＿＿＿을 지키고 긍정적인 표현으로 소통하도록 안내한다.",
        "answer": "언어 예절"
      }
    ],
    "evaluation": [
      {
        "area": "",
        "question": "(가) 평가 항목은 컴퓨팅 사고력, 디지털 문화 소양, 인공지능 소양의 ＿＿＿＿를 기반으로 구체화한다.",
        "answer": "하위 요소"
      },
      {
        "area": "",
        "question": "(나) 평가 내용은 지식 이해뿐 아니라, 과정 기능, ＿＿＿＿의 측면 등을 다면적으로 반영하고 과정을 중시하는 평가를 통해 학생의 성장과 발달을 돕는 평가를 실현한다.",
        "answer": "가치 태도"
      },
      {
        "area": "",
        "question": "(다) 구체적인 평가 ＿＿＿＿을 학생과 함께 구성하는 과정을 통해 학생이 자신의 학습 수준을 파악하고 스스로 학습을 성찰할 수 있는 기회를 제공한다.",
        "answer": "루브릭"
      },
      {
        "area": "",
        "question": "(라) 효율적인 평가를 위하여 다양한 디지털 도구를 활용할 수 있으나 학생이 디지털 도구 활용의 미숙으로 인해 평가에 ＿＿＿＿를 받지 않도록 사용법을 익히는 데 부담을 최소화한다.",
        "answer": "불이익"
      },
      {
        "area": "",
        "question": "(가) 성취기준을 분석하고 재구성하여 지필평가에 국한하지 않고, 학생의 성장에 기여할 수 있는 평가 ＿＿＿＿를 계획한다.",
        "answer": "포트폴리오"
      },
      {
        "area": "",
        "question": "예를 들면, 관찰 평가, 서술형평가, 수행평가 등을 활용하거나, 자기 평가, ＿＿＿＿ 평가 등과 같은 다면적 평가를 실행한다.",
        "answer": "동료"
      },
      {
        "area": "",
        "question": "(나) 평가 내용이나 방법에 따라 다양한 디지털 도구(프로그램 자동 평가시스템(＿＿＿＿ 등), 학습관리시스템(LMS) 등)를 활용할 수 있다.",
        "answer": "online judge"
      },
      {
        "area": "",
        "question": "(다) 모둠별 프로젝트 활동의 과정 및 성과물에 대해 전반적으로 평가할 뿐 아니라 협업 및 발표, 토론, 의사 소통, ＿＿＿＿ 등을 합리적으로 평가할 수 있도록, 구체적이고 객관적인 평가기준과 체크리스트를 마련한다.",
        "answer": "협력적 태도"
      },
      {
        "area": "",
        "question": "(라) 토의·토론 평가 시 주장, 근거, 토의 결과를 통한 결론 등이 포함된 ＿＿＿＿를 활용하여 어떤 주장을 하고자 했는지, 객관적인 근거를 제시하였는지 등을 평가한다.",
        "answer": "토의·토론 기록지"
      }
    ]
  }
};
